{"/about":{"title":"About","data":{"":"This is the about page! This page is shown on the navbar."}},"/components":{"title":"Componentes","data":{"":"Fenextjs posee componentes para implementar en Nextjs con el objetivo de ahorrar tiempo en el desarrollo de funcionalidades, para solo consentrarce en los estilos de los componentes","lista-de-componentes-disponibles-categorizados-de-la-siguiente-manera-#Lista de componentes disponibles categorizados de la siguiente manera >>>":"Estructurales\n⚙️ Configuración\n🟩 Forma\nNavegación\n🍎 Usabilidad\n🔃 Carga\n⌛ Progreso\nElementos\n🅰️ Texto\n🖼️ Imágenes\n⌨️ Entradas de texto\n📅 Fechas\n📢 Comunicación\n🗒️ Orden\n👑 Lujo","#":"","estucturales#Estucturales":"","️-configuración#⚙️ Configuración":"Theme > El componente de Theme permite definir y aplicar un conjunto coherente de estilos y paletas de colores en toda la aplicación. Es fundamental para mantener la consistencia visual y para implementar fácilmente cambios de temas o modos (como claro/oscuro).\nLayout > Proporciona estructuras predeterminadas para el diseño de páginas.\nLayout Grid Menu Left > Organiza la página con un menú lateral a la izquierda, optimizando el uso del espacio y facilitando la navegación en la aplicación.\nLayout Grid Menu Top > Presenta un diseño con un menú en la parte superior, adecuado para aplicaciones con enfoque en la horizontalidad y accesibilidad rápida a diferentes secciones.\nLayout Grid Menu TopLeft > Combina ambas disposiciones, con menús tanto en la parte superior como en el lado izquierdo, proporcionando una estructura de navegación robusta y flexible para aplicaciones complejas o sitios web.","-1#":"","-forma#🟩 Forma":"Header > Cabecera de sitio o aplicación, incluye navegación y elementos clave de UI como logos, menús o controles de usuario.\nUser Profile >\nContainer > Contenedor básico para alinear y organizar elementos, esencial en el diseño web responsivo y en la estandarización de layouts.\nBox > Contenedor genérico para UI, útil para agrupar elementos relacionados visualmente, como en dashboards o en la agrupación de formularios.\nColumns > Estructura para diseño de columnas, fundamental en layouts responsivos o para organizar contenido en secciones claramente definidas.\nTwo Col Sticky > ste componente estructura la página en dos columnas, con una de ellas fija (\"sticky\") que permanece visible mientras se desplaza la otra. Es ideal para diseños que requieren una navegación constante o elementos de referencia, como menús laterales o dashboards con filtros.\nContentShow > Mostrar contenido de manera condicional, ideal para interfaces dinámicas donde el contenido depende de ciertas condiciones o selecciones del usuario.","-2#":"","navegación#Navegación":"","-usabilidad#🍎 Usabilidad":"Menu > El componente Menu actúa como el contenedor para un conjunto de ItemMenu o enlaces de navegación. Es esencial para la creación de barras de navegación, menús desplegables o paneles laterales, organizando las opciones de navegación de manera estructurada y coherente. - Button Menu > Este componente es un botón interactivo diseñado para activar o desplegar un menú de navegación. Es ideal para interfaces que requieren menús compactos, especialmente en diseños responsivos o en aplicaciones móviles. - Item Menu > Representa un elemento individual dentro de un menú. Cada ItemMenu es un enlace o acción en la lista de navegación, permitiendo una organización clara y accesible de las opciones del menú.\nBack > Botón para retroceder en el flujo del usuario. Comúnmente usado en aplicaciones con múltiples niveles de navegación o en flujos de trabajo paso a paso.\nBreadcrumb > Indicador de la ruta de navegación actual. Esencial en sitios web con estructura jerárquica profunda, como tiendas en línea o sitios de contenido.\nButton > Elemento interactivo para acciones de usuario, como enviar formularios, abrir ventanas modales o activar funciones. Clave en cualquier interfaz interactiva.\nShare > El componente Share permite a los usuarios compartir contenido de la página en redes sociales o plataformas de mensajería. Es esencial en sitios que buscan aumentar su alcance y promover la interacción social.\nLink > Navegación interna o externa, fundamental en cualquier interfaz para conectar diferentes áreas o recursos.\nTab > Pestañas para organizar contenido en secciones, comunes en interfaces de configuración, perfiles de usuario o en áreas con múltiples categorías de contenido.\nPagination > Navegación por páginas de contenido, esencial en sitios con listados largos como blogs, catálogos de productos o bases de datos.\nPagination All > Este componente de paginación está diseñado para mostrar todas las páginas disponibles en una interfaz, permitiendo a los usuarios saltar directamente a cualquier página. Es útil en situaciones donde se necesita un acceso rápido a páginas específicas en un conjunto de datos extenso.\nPagination Page > Un componente de paginación que muestra un número determinado de páginas alrededor de la página actual, con opciones para avanzar hacia adelante y atrás. Este enfoque es ideal para conjuntos de datos grandes, donde mostrar todas las páginas a la vez puede ser abrumador o poco práctico.\nPagination Item Page > Representa un elemento individual en un sistema de paginación. Cada ItemPage es un enlace a una página específica, permitiendo la navegación precisa dentro de un conjunto de datos o contenido paginado.\nSteps > El componente Steps es utilizado para mostrar una secuencia de pasos en un proceso, como en formularios de registro o procesos de compra. Ofrece una manera clara y visual de indicar el progreso a través de diferentes etapas, ayudando a los usuarios a comprender su posición actual y los pasos siguientes en un procedimiento.","-3#":"","-carga#🔃 Carga":"Loader > Indicadores de carga para procesos o cargas de contenido, mejoran la experiencia de\nLoader Progress Line > Este componente muestra una barra de progreso horizontal que se llena gradualmente para indicar el avance de una tarea o carga. Es ideal para procesos donde se puede determinar el progreso, como la carga de archivos o el envío de formularios.\nLoader Spinner > Un indicador circular o 'spinner' que gira para mostrar que una operación está en curso. Es ampliamente utilizado en aplicaciones y sitios web durante la espera de procesos que no tienen un tiempo de finalización definido, como la carga de datos desde un servidor.\nLoader Skeleton > Este loader simula la disposición del contenido antes de que se cargue completamente, usando líneas o formas en el lugar donde aparecerá el contenido real. Es efectivo para mejorar la experiencia del usuario durante la carga de páginas, reduciendo la percepción de espera y manteniendo la estructura visual de la página.\nContent Loading > Indica el estado de carga del contenido, mejorando la experiencia del usuario en cargas asincrónicas o en espera de datos.","-4#":"","-progreso#⌛ Progreso":"Progress > Un indicador visual para mostrar el progreso de una tarea o proceso. Puede ser utilizado en situaciones donde se necesite representar visualmente el avance, como en cargas de archivos, procesos de instalación o progreso de tareas.\nPage Progress > Este componente es utilizado para mostrar el progreso de carga de una página completa. Es ideal para informar a los usuarios sobre el estado de carga de la página, especialmente en sitios web con contenido pesado o en aplicaciones web que requieren tiempo para cargar datos.\nProgress Line > Es una variante del indicador de progreso que muestra una barra lineal. Se utiliza comúnmente para representar el progreso de manera simple y clara, como en el progreso de descargas o en barras de carga de formularios.\nProgress Circle > Este estilo muestra el progreso en un formato circular, lo que es ideal para espacios compactos o para una presentación estética más dinámica, como en dashboards o en interfaces de aplicaciones móviles.","-5#":"","elementos#Elementos":"","🅰️-texto#🅰️ Texto":"Title > Un componente para crear títulos y encabezados. Es esencial para estructurar el contenido, destacar secciones y mejorar la legibilidad en interfaces y páginas web.\nText > Este componente se utiliza para la presentación de texto en la interfaz, ofreciendo flexibilidad para diferentes estilos, como párrafos, citas o cualquier otro formato de texto.\nTooltip > Proporciona información adicional en forma de texto emergente cuando el usuario pasa el cursor sobre un elemento. Ideal para explicar funciones de botones, iconos o para proporcionar detalles adicionales sin sobrecargar la interfaz.\nCopy > Funcionalidad para copiar texto al portapapeles, útil en interfaces donde los usuarios necesitan replicar información rápidamente, como en aplicaciones de código o datos.\nChronometer: > Mide y muestra tiempo, ideal en aplicaciones de productividad, temporizadores de eventos o para seguimiento de actividades.","-6#":"","️-imágenes#🖼️ Imágenes":"Img > Componente para integrar y gestionar imágenes, clave en cualquier interfaz que requiera visualización de imágenes, como blogs, galerías o productos.\nGrid Gallery > Presenta imágenes o contenido en formato de cuadrícula, ideal para portfolios, catálogos de productos o galerías de medios.s\nGallery > Galería para mostrar colecciones de imágenes, usada en sitios de fotografía, portafolios de diseño o catálogos de productos.\nSlider Generic > Un componente versátil que puede ser utilizado no solo para imágenes, sino también para cualquier tipo de contenido deslizable, como texto, tarjetas de información o galerías multimedia.\nSlider > Carrusel de imágenes, popular en páginas de inicio, en presentaciones de productos o en portfolios.\nMedia > Este componente se enfoca en la integración y visualización de contenido multimedia, como imágenes, videos y audio, en la interfaz de usuario. Es perfecto para aplicaciones que requieren una manipulación intensiva de medios.\nMedia Input > Especializado en la carga y entrada de archivos multimedia. Facilita a los usuarios subir sus propios archivos de medios, siendo ideal para plataformas que permiten la personalización del contenido multimedia por parte del usuario.","-7#":"","-comunicación#📢 Comunicación":"Counter > Contador interactivo, común en carritos de compra, configuraciones de cantidad o en interfaces donde se requiere ajuste numérico.\nModal > Componente para crear ventanas emergentes o diálogos. Utilizado para mostrar información adicional, recolectar datos del usuario o proporcionar alertas y confirmaciones en un contexto sobreimpuesto al contenido principal.\nNotification > Este componente se utiliza para mostrar mensajes breves al usuario. Esencial para proporcionar retroalimentación instantánea o alertas sobre acciones o cambios en el estado de la aplicación.\nNotification Pop > Una variante de notificación que aparece temporalmente en la pantalla, usualmente en una esquina, y se esconde automáticamente. Ideal para mensajes que no requieren una acción inmediata del usuario.\nPrint > Facilita la impresión de contenido específico desde la aplicación.\nPrint impresaframe > Permite imprimir contenido alojado en un iframe, como documentos o reportes generados dinámicamente dentro de la aplicación.\nPrint Page > Diseñado para imprimir toda la página o secciones específicas de ella, manteniendo el formato y estilo adecuados para la salida impresa.\nError Component > Muestra errores o problemas, esencial para una buena experiencia de usuario en la gestión de errores y en la presentación de feedbacks críticos.","-8#":"","️-entradas-de-texto#⌨️ Entradas de texto":"Form > Estructura para crear formularios interactivos, fundamental en la recolección de datos, configuraciones de usuario y en interacciones esenciales del usuario.\nInput > Varios tipos de campos de entrada para formularios, esenciales para cualquier interacción que requiera entrada de datos por parte del usuario.\nCard > El componente de Input para tarjetas de crédito en Fenext JS es una herramienta especializada para la entrada de información de tarjetas de crédito. Este componente simplifica el proceso de recolección de datos de tarjetas, proporcionando campos específicos para el número de tarjeta, fecha de vencimiento, y código de seguridad (CVV). Es ideal para interfaces de pago o formularios donde se requiere información de tarjetas de crédito, garantizando una experiencia de usuario fluida y segura.\nInput Card CCV >\nInput Card Number >\nInput Checkbox >\nInput Code >\nInput Date >\nInput Date Range >\nInput File >\nInput Gallery >\nGoogle >\nInput Google Autocomplete >\nInputGoogleLoadScript >\nInput GoogleMaps >\nInput Img >\nInput Number >\nInput NumberCount >\nInput Password >\nInput Phone >\nInput Radio >\nInput Range >\nInput Rate >\nInput Search >\nInput Select >\nInput Select Country >\nInput Select Country Multiple >\nInput Select CSC >\nInput Select Multiple >\nInput Select Number >\nInput Select Option >\nInput Swich >\nInput Text >\nInput Text Select >\nUnit >\nInput Unit Base >\nInput Unit Distance >\nInput Unit Volumen >\nInput Unit Weight >\nInput Upload >","-9#":"","-fechas#📅 Fechas":"Schedule > Este componente es utilizado para organizar y mostrar eventos o actividades en un calendario. Facilita la planificación y visualización de agendas en aplicaciones o sitios web.\nSchedule Day > Una variante del componente Schedule enfocada en la visualización diaria. Muestra eventos o tareas programadas para un día específico, ideal para agendas detalladas o itinerarios diarios.\nSchedule Weekly > Se centra en la organización semanal. Presenta una vista de toda la semana, permitiendo a los usuarios ver y planificar actividades a lo largo de varios días. Útil para horarios semanales o planificaciones a mediano plazo.","-10#":"","️-orden#🗒️ Orden":"Table > El componente Table sirve para mostrar datos en un formato de filas y columnas, facilitando la organización y visualización de información compleja. Es ideal para dashboards, reportes financieros, y listas de datos, donde una representación clara y ordenada es fundamental.\nDrop Down > Menú desplegable para seleccionar opciones, ampliamente utilizado en formularios, filtros de búsqueda o navegación compacta.\nChronological List > Lista para mostrar eventos o elementos en orden cronológico. Útil en timelines, historiales de transacciones o listados de eventos.\nCollapse > Permite mostrar u ocultar contenido. Utilizado en FAQs, paneles de control con opciones avanzadas o para reducir la sobrecarga visual en interfaces complejas.\nSimple > Este componente permite a los usuarios mostrar u ocultar contenido individual con un simple clic. Es ideal para interfaces donde se necesita compactar información, como en secciones de preguntas frecuentes o en paneles de control donde el espacio es limitado.\nMultiple > Similar al Collapse Simple, pero diseñado para manejar múltiples secciones de contenido colapsables simultáneamente. Es útil en interfaces complejas donde varios conjuntos de información necesitan ser accesibles sin abrumar al usuario, como en menús extensos o en paneles de información detallada.","-11#":"","-lujo#👑 Lujo":"Lava Lamp > El componente Lava Lamp añade un efecto visual fluido y colorido a interfaces, ideal para realzar la estética y captar la atención del usuario.","-12#":"","instalacion-independiente#Instalacion independiente":"En caso de que solo quieras usar la parte de componentes de Fenextjs sin installar el resto de funcionalidades, puedes hacerlo de siguiente manera:","npm#Npm":"npm i fenextjs-component","bun#Bun":"bun i fenextjs-component","pnpm#Pnpm":"pnpm i fenextjs-component"}},"/components/back":{"title":"Back","data":{"":"El componente Back es una representación visual de un botón de retroceso (atrás) que permite al usuario navegar a la página anterior en la historia del navegador, utilizar la funcionalidad de Next.js Router, redirigir a una URL específica o simplemente ejecutar una función personalizada al hacer clic en el botón.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Back, se puede hacer desde fenextjs o fenextjs-component\nimport { Back, BackProps } from \"fenextjs/cjs/component/Back\";\no\nimport { Back, BackProps } from \"fenextjs-component/cjs/Back\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tno\tfalse\tSi el componente esta en estado loader, con un indicardor de spiner y deshabilitada su funcionalidad\tdisabled\tboolean\tno\tfalse\tSi el componente esta en estado disabled, por ende se deshabilita su funcionalidad\tonClick\tfunction\tno\t\tFuncion que se ejecuta por onClick en el componente, (solo se ejecuta si loader y disabled son false)\ticon\tReactNode\tno\tSvg:PaginationPre\tIcono del componente\tchildren\tReactNode\tno\t\"Back\"\tContenido del componente\ttypeOnBack\t\"history\" |\"router\" |\"link\" |\"none\"\tno\t\"history\"\tTipo de accion al ejecutar onClick en el componente\tlink\tstring\tno\t\"\"\tEl link a donde redireccionar si el campo typeOnBack = \"link\"\tuseHistoryMinLenght\tboolean\tno\tfalse\tSi el componente esta en estado useHistoryMinLenght, se verificara el valor de \"window.history.length\" para que sea mayor al parametro \"minLenght\", si la condicion no se cumple, el componente no se renderisa\tminLenght\tnumber\tno\t2\tEl valor de comparacion en caso de que \"useHistoryMinLenght\" sea true, la validacion para que no se renderice el componente es: window.history.length < minLenght\tclassName\tstring\tno\t\"\"\tClase personalizada del componente\tclassNameDisabled\tstring\tno\t\"\"\tClase personalizada del componente cuando esta en estado disabled\tclassNameIcon\tstring\tno\t\"\"\tClase personalizada del icono\tclassNameContent\tstring\tno\t\"\"\tClase personalizada del contenido\tclassNameLoader\tstring\tno\t\"\"\tClase personalizada del componente cuando esta en estado loader","redireccionamiento#Redireccionamiento":"Dependiendo de el valor typeOnBack la redirecion se ejecutara de forma distrinta:\ntypeOnBack\tRedireccion\tDescripcion\thistory\thistory.back()\tRedirección a la página anterior mediante la historia del navegador\trouter\trouter.back()\tRedirección a la página anterior mediante Next.js Router\tlink\trouter.push(link)\tRdirección a la url mediante Next.js Router\tnone\tnone\tNo se redirecciona","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Basico\n<Back />\nBack con texto personalizado\n<Back>Go Back</Back>\nBack con icono personalizado y tipo de redirección a una URL\n<Back\n  icon={<img src=\"/custom-back-icon.svg\" alt=\"Back Icon\" />}\n  typeOnBack=\"link\"\n  link=\"/previous-page\"\n>\n  Back to Previous Page\n</Back>\nBack en estado de carga (loader)\n<Back loader={true}>Loading...</Back>\nBack deshabilitado\n<Back disabled={true}>Disabled Back</Back>\nBack con redirección a la página anterior mediante Next.js Router\n<Back typeOnBack=\"router\">Go to Previous Route</Back>\nBack con redirección a la página anterior mediante la historia del navegador\n<Back typeOnBack=\"history\">Go Back in History</Back>\nBack con función personalizada\n<Back onClick={() => alert(\"Custom function executed!\")} typeOnBack=\"none\">\n  Custom Click Function\n</Back>"}},"/components/box":{"title":"Box","data":{"":"El componente Box es un componente simple que representa un contenedor que puede ser utilizado para agrupar contenido dentro de una caja con estilos personalizados.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Box, se puede hacer desde fenextjs o fenextjs-component\nimport { Box, BoxProps } from \"fenextjs/cjs/component/Box\";\no\nimport { Box, BoxProps } from \"fenextjs-component/cjs/Box\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tchildren\tReactNode\tno\t\tContenido del componente\tclassName\tstring\tno\t\"\"\tClase personalizada del componente","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Box\n<Box>\n  <h2>Contenido dentro del Box</h2>\n  <p>Este es un párrafo dentro del Box.</p>\n</Box>\nBox con clase de estilo personalizada\n<Box className=\"custom-box\">\n  <h2>Contenido personalizado dentro del Box</h2>\n  <p>Este es otro párrafo dentro del Box con estilos personalizados.</p>\n</Box>"}},"/components/breadcrumb":{"title":"Breadcrumb","data":{"":"El componente Breadcrumb es una representación visual de una lista de enlaces que proporcionan una navegación jerárquica en una aplicación web. Cada enlace en la lista se muestra con una etiqueta \"a\" que permite redirigir al usuario a la URL especificada.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Breadcrumb, se puede hacer desde fenextjs o fenextjs-component\nimport { Breadcrumb, BreadcrumbProps } from \"fenextjs/cjs/component/Breadcrumb\";\no\nimport { Breadcrumb, BreadcrumbProps } from \"fenextjs-component/cjs/Breadcrumb\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tlinks\tBreadcrumbLinkProps[]\tsi\t\tLista de links para el componente\tclassName\tstring\tno\t\"\"\tClase personalizada del componente\tclassNameItem\tstring\tno\t\"\"\tClase personalizada de los items\tclassNameLink\tstring\tno\t\"\"\tClase personalizada de los links","parametros-de-los-links-breadcrumblinkprops#Parametros de los links (BreadcrumbLinkProps)":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\thref\tstring\tsi\t\tUrl del link\tchildren\tReactNode\tsi\t\tContenido del link\tonClick\tfunction\tno\t\tFuncion que se ejecuta en el evento onClick del link","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Breadcrumb\nconst breadcrumbLinks = [\n  { href: \"/\", children: \"Home\" },\n  { href: \"/products\", children: \"Products\" },\n  { href: \"/products/category\", children: \"Category\" },\n];\n<Breadcrumb links={breadcrumbLinks} />;\nBreadcrumb con clase de estilo personalizada\nconst breadcrumbLinks = [\n  { href: \"/\", children: \"Home\" },\n  { href: \"/products\", children: \"Products\" },\n  { href: \"/products/category\", children: \"Category\" },\n];\n<Breadcrumb\n  links={breadcrumbLinks}\n  className=\"custom-breadcrumb\"\n  classNameItem=\"custom-breadcrumb-item\"\n  classNameLink=\"custom-breadcrumb-link\"\n/>;\nBreadcrumb con evento de click personalizado\nconst breadcrumbLinks = [\n  { href: \"/\", children: \"Home\" },\n  { href: \"/products\", children: \"Products\" },\n  { href: \"/products/category\", children: \"Category\" },\n];\nconst handleLinkClick = () => {\n  console.log(\"Breadcrumb link clicked!\");\n};\n<Breadcrumb\n  links={[\n    { href: \"/\", children: \"Home\" },\n    {\n      href: \"/products\",\n      children: \"Products\",\n      onClick: handleLinkClick,\n    },\n    { href: \"/products/category\", children: \"Category\" },\n  ]}\n/>;"}},"/components/button":{"title":"Button","data":{"":"El componente Button es un componente versátil que representa un botón interactivo. Puede renderizarse como un elemento \"button\" o como un contenedor \"div\", y proporciona varias opciones de personalización, incluyendo tamaño, icono y estado de carga.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Button, se puede hacer desde fenextjs o fenextjs-component\nimport { Button, ButtonProps } from \"fenextjs/cjs/component/Button\";\no\nimport { Button, ButtonProps } from \"fenextjs-component/cjs/Button\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tno\tfalse\tSi el componente esta en estado loader, con un indicardor de spiner y deshabilitada su funcionalidad\tdisabled\tboolean\tno\tfalse\tSi el componente esta en estado disabled, por ende se deshabilita su funcionalidad\tonClick\tfunction\tno\t\tFuncion que se ejecuta por onClick en el componente, (solo se ejecuta si loader y disabled son false)\ticon\tReactNode\tno\t\"\"\tIcono del componente\tchildren\tReactNode\tno\t\tContenido del componente\tisBtn\tboolean\tno\ttrue\tSi es false se usara la etiquera \"div\" y no la \"button\"\tsize\t\"extra-small\"| \"small\" |\"normal\" |\"strong\" |\"extra-strong\"\tno\t\"normal\"\tTamaño del bottom, es posible personalizar los tamaños\tfull\tboolean\tno\tfalse\tSi es true el botton tendra width:100%\tclassName\tstring\tno\t\"\"\tClase personalizada del componente\tclassNameLoader\tstring\tno\t\"\"\tClase personalizada del loader","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Button\nconst handleButtonClick = () => {\n  console.log(\"Button clicked!\");\n};\n<Button onClick={handleButtonClick}>Click Me</Button>;\nButton con clase de estilo personalizada\n<Button className=\"custom-button\">Custom Button</Button>\nButton con loadding\n<Button loader={true}>Loadding....</Button>\nButton deshabilitado\n<Button disabled={true}>Disabled Button</Button>\nButton como un contenedor \"div\"\n<Button isBtn={false}>Div Button</Button>\nButton con tamaño personalizado\n<Button size=\"extra-strong\">Extra Strong Button</Button>\nButton a lo ancho\n<Button full={true}>Full Width Button</Button>"}},"/components/chronological-list":{"title":"ChronologicalList","data":{"":"El componente ChronologicalList es un componente que muestra una lista de eventon ordenados por fecha.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ChronologicalList, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ChronologicalList,\n  ChronologicalListProps,\n} from \"fenextjs/cjs/component/ChronologicalList\";\no\nimport {\n  ChronologicalList,\n  ChronologicalListProps,\n} from \"fenextjs-component/cjs/ChronologicalList\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\titems\tChronologicalListItemsProps[]\tsí\t\tLista de elementos para la lista cronológica.\tmarket\tReactNode\tno\t\tIcon personalizado para todos los elementos.\tparseDateYYYYMMDD\t(date: Date) => string\tno\t\tFunción para personalizar día, mes y año de la fecha.\tparseDateHHMMSS\t(date: Date) => string\tno\t\tFunción para personalizar horas, minutos y segundos de la fecha.","chronologicallistitemsprops#ChronologicalListItemsProps":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tdate\tDate\tsí\t\tFecha asociada al elemento.\tchildren\tReactNode\tsí\t\tContenido del elemento.\tmarket\tReactNode\tno\t\tIcon personalizado para este elemento.\tclassName\tstring\tno\t\"\"\tClase personalizada del componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ChronologicalList\n<ChronologicalList\n  items={[{ date: new Date(), children: \"Contenido del elemento\" }]}\n  parseDateYYYYMMDD={(date) => date.toISOString()}\n  parseDateHHMMSS={(date) => date.toLocaleTimeString()}\n/>"}},"/components/chronometer":{"title":"Chronometer","data":{"":"El componente Chronometer es un componente que muestra un tiempo en descenso hasta llegar al tiempo minimo.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Chronometer, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  Chronometer,\n  ChronometerProps,\n} from \"fenextjs/cjs/component/Chronometer\";\no\nimport {\n  Chronometer,\n  ChronometerProps,\n} from \"fenextjs-component/cjs/Chronometer\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\ttime\tnumber\tno\t\tEl tiempo en segundos para el componente.\tonChange\t(time: number) => void\tno\t\tFunción de cambio de tiempo para el componente.\tmin\tnumber\tno\t\tEl mínimo en segundos para el componente.\toptionsTimeToText\tgetTimeToTextProps\tno\t\tOpciones para convertir tiempo a texto en el componente.","gettimetotextprops#getTimeToTextProps":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tdays\tboolean\tno\ttrue\tIncluir el componente de días en la salida. Por defecto, true.\thours\tboolean\tno\ttrue\tIncluir el componente de horas en la salida. Por defecto, true.\tminutes\tboolean\tno\ttrue\tIncluir el componente de minutos en la salida. Por defecto, true.\tseconds\tboolean\tno\ttrue\tIncluir el componente de segundos en la salida. Por defecto, true.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Chronometer\n<Chronometer\n  time={60}\n  onChange={(newTime) => console.log(`Nuevo tiempo: ${newTime} segundos`)}\n  min={0}\n/>"}},"/components/collapse":{"title":"Collapse","data":{"":"El componente Collapse es un componente que muestra un contenido colapsado y un header para interactuar con el contenido.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Collapse, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  Collapse,\n  CollapseProps,\n} from \"fenextjs/cjs/component/Collapse/Simple\";\no\nimport {\n  Collapse,\n  CollapseProps,\n} from \"fenextjs-component/cjs/Collapse/Simple\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tloader\tboolean\tno\t\tIndica si el Collapse está actualmente en estado de carga.\tdisabled\tboolean\tno\t\tIndica si el Collapse está deshabilitado o no.\tdefaultActive\tboolean\tno\t\tIndica si el Collapse está activo por defecto para mostrar.\tactive\tboolean\tno\t\tIndica si el Collapse está activo para mostrar.\tname\tstring\tno\t\tEl nombre para el Collapse.\tstatus\t\"none\" | \"error\" | \"ok\"\tno\t\tEstado del collapse. Puede ser \"none\", \"error\" u \"ok\".\ttype\t\"radio\" | \"checkbox\"\tno\t\tTipo de collapse. Puede ser \"radio\" o \"checkbox\".\tshow\t\"checked\" | \"focus\"\tno\t\tTipo de forma para mostrar el collapse. Puede ser \"checked\" o \"focus\".\theader\tReactNode\tsí\t\tEncabezado del Collapse.\tonChange\t(value: boolean) => void\tno\t\tFunción de cambio del Collapse.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Collapse\n<Collapse\n  loader={false}\n  disabled={false}\n  defaultActive={false}\n  active={true}\n  name=\"exampleCollapse\"\n  status=\"ok\"\n  type=\"checkbox\"\n  show=\"focus\"\n  header={<HeaderComponent />}\n  onChange={(value) =>\n    console.log(`Collapse cambiado a ${value ? \"activo\" : \"inactivo\"}`)\n  }\n>\n  Contenido del Collapse\n</Collapse>"}},"/components/collapse/multiple":{"title":"CollapseMultiple","data":{"":"El componente CollapseMultiple es un componente que muestra multiples contenidos colapsados y headers para interactuar con los contenidos.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente CollapseMultiple, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  CollapseMultiple,\n  CollapseMultipleProps,\n} from \"fenextjs/cjs/component/Collapse/Multiple\";\no\nimport {\n  CollapseMultiple,\n  CollapseMultipleProps,\n} from \"fenextjs-component/cjs/Collapse/Multiple\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tname\tstring\tsí\t\tEl nombre para el componente.\ttype\t\"radio\" | \"checkbox\"\tsí\t\tTipo de collapse. Puede ser \"radio\" o \"checkbox\".\titems\tCollapseBaseProps[]\tno\t\tElementos del Collapse.\tdefaultActive\tnumber | number[]\tno\t\tEstado activo por defecto del Collapse. Puede ser un número o un array de números.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente CollapseMultiple\n<CollapseMultiple\n  name=\"exampleCollapse\"\n  type=\"checkbox\"\n  items={[\n    { disabled: false, defaultActive: true, header: \"Item 1\" },\n    { disabled: true, defaultActive: false, header: \"Item 2\" },\n    // Agrega más elementos según sea necesario\n  ]}\n>\n  Contenido del CollapseMultiple\n</CollapseMultiple>"}},"/components/collapse/simple":{"title":"Collapse","data":{"":"El componente Collapse es un componente que muestra un contenido colapsado y un header para interactuar con el contenido.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Collapse, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  Collapse,\n  CollapseProps,\n} from \"fenextjs/cjs/component/Collapse/Simple\";\no\nimport {\n  Collapse,\n  CollapseProps,\n} from \"fenextjs-component/cjs/Collapse/Simple\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tloader\tboolean\tno\t\tIndica si el Collapse está actualmente en estado de carga.\tdisabled\tboolean\tno\t\tIndica si el Collapse está deshabilitado o no.\tdefaultActive\tboolean\tno\t\tIndica si el Collapse está activo por defecto para mostrar.\tactive\tboolean\tno\t\tIndica si el Collapse está activo para mostrar.\tname\tstring\tno\t\tEl nombre para el Collapse.\tstatus\t\"none\" | \"error\" | \"ok\"\tno\t\tEstado del collapse. Puede ser \"none\", \"error\" u \"ok\".\ttype\t\"radio\" | \"checkbox\"\tno\t\tTipo de collapse. Puede ser \"radio\" o \"checkbox\".\tshow\t\"checked\" | \"focus\"\tno\t\tTipo de forma para mostrar el collapse. Puede ser \"checked\" o \"focus\".\theader\tReactNode\tsí\t\tEncabezado del Collapse.\tonChange\t(value: boolean) => void\tno\t\tFunción de cambio del Collapse.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Collapse\n<Collapse\n  loader={false}\n  disabled={false}\n  defaultActive={false}\n  active={true}\n  name=\"exampleCollapse\"\n  status=\"ok\"\n  type=\"checkbox\"\n  show=\"focus\"\n  header={<HeaderComponent />}\n  onChange={(value) =>\n    console.log(`Collapse cambiado a ${value ? \"activo\" : \"inactivo\"}`)\n  }\n>\n  Contenido del Collapse\n</Collapse>"}},"/components/cols":{"title":"Cols","data":{"":"El componente Cols es un componente que muestra el contenido dividido en columnas.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Cols, se puede hacer desde fenextjs o fenextjs-component\nimport { Cols, ColsProps } from \"fenextjs/cjs/component/Cols\";\no\nimport { Cols, ColsProps } from \"fenextjs-component/cjs/Cols\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tnCols\tnumber | string\tno\t\tEl número de columnas para el componente.\tbreakInside\tboolean\tno\t\tIndica si se permite el salto de columna dentro del componente.\tchildren\tReactNode\tno\t\tContenido del componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Cols\n<Cols nCols={3} breakInside={true}>\n  {/* Contenido de las columnas */}\n</Cols>"}},"/components/container":{"title":"Container","data":{"":"El componente Container es un componente que muestra el contenido encapsulado en contenedor.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Container, se puede hacer desde fenextjs o fenextjs-component\nimport { Container, ContainerProps } from \"fenextjs/cjs/component/Container\";\no\nimport { Container, ContainerProps } from \"fenextjs-component/cjs/Container\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tcustomSize\tnumber\tno\t\tTamaño personalizado del contenedor en unidades de 16 * rem.\tusePaddingInline\tboolean\tno\t\tUsar relleno en línea en el contenedor.\tchildren\tReactNode\tno\t\tContenido del contenedor.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Container\n<Container>{/* Contenido del Container */}</Container>"}},"/components/content-loading":{"title":"ContentLoading","data":{"":"El componente ContentLoading es un componente que muestra el contenido o un loader personalizado.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ContentLoading, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ContentLoading,\n  ContentLoadingProps,\n} from \"fenextjs/cjs/component/ContentLoading\";\no\nimport {\n  ContentLoading,\n  ContentLoadingProps,\n} from \"fenextjs-component/cjs/ContentLoading\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tchildren\tReactNode\tno\t\tContenido del componente.\tcomponentLoader\tReactNode\tno\t<LoaderSpinner/>\tComponente utilizado como cargador.\tloader\tboolean\tno\tfalse\tIndica si el componente está en estado de carga.\tisPage\tboolean\tno\tfalse\tIndica si el componente es una página completa.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ContentLoading\n<ContentLoading componentLoader={<CustomLoader />} loader={true} isPage={false}>\n  {/* Contenido del componente */}\n</ContentLoading>"}},"/components/content-show":{"title":"ContentShow","data":{"":"El componente ContentShow es un componente que muestra u oculta el contenido con estilos.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ContentShow, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ContentShow,\n  ContentShowProps,\n} from \"fenextjs/cjs/component/ContentShow\";\no\nimport {\n  ContentShow,\n  ContentShowProps,\n} from \"fenextjs-component/cjs/ContentShow\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tchildren\tReactNode\tno\t\tContenido del componente.\tshow\tboolean\tno\t\tIndica si el contenido debe mostrarse o no.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ContentShow\n<ContentShow show={true}>{/* Contenido del componente */}</ContentShow>"}},"/components/copy":{"title":"Copy","data":{"":"El componente Copy es un componente que muestra contenido que al hacer click copia un texto definido.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Copy, se puede hacer desde fenextjs o fenextjs-component\nimport { Copy, CopyProps } from \"fenextjs/cjs/component/Copy\";\no\nimport { Copy, CopyProps } from \"fenextjs-component/cjs/Copy\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\ttext\tstring\tno\t\tEl texto para copiar.\tchildren\tReactNode\tno\t\tContenido del componente.\tonClickForCopy\t(text: string) => void\tno\t\tFunción a ejecutar al hacer clic para copiar.\tnotification\tNotificationDataProps\tno\t\tDatos para la notificación asociada al componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Copy\n<Copy\n  text=\"Texto a copiar\"\n  onClickForCopy={(text) => console.log(`Texto copiado: ${text}`)}\n  notification={{ type: \"info\", message: \"Texto copiado exitosamente\" }}\n>\n  {/* Contenido del componente */}\n</Copy>"}},"/components/counter":{"title":"Counter","data":{"":"El componente Counter es un componente que muestra un numero en aumento hasta llegar al numero establecido.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Counter, se puede hacer desde fenextjs o fenextjs-component\nimport { Counter, CounterProps } from \"fenextjs/cjs/component/Counter\";\no\nimport { Counter, CounterProps } from \"fenextjs-component/cjs/Counter\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tnumber\tnumber\tsí\t\tNúmero a mostrar.\ttext\tReactNode\tno\tundefined\tTexto a mostrar. Por defecto, no se muestra texto.\ttime\tnumber\tno\t1000\tTiempo para incrementar el número en milisegundos.\tdecimal\tnumber\tno\t2\tNúmero de decimales a mostrar en el número.\tparseNumber\t(n: number) => ReactNode\tno\tparseNumberCount\tFunción para formatear el número.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Counter\n<Counter\n  number={123.456}\n  text={<span>Texto adicional</span>}\n  time={2000}\n  decimal={3}\n  parseNumber={(n) => <strong>{n}</strong>}\n/>"}},"/components/dropdown":{"title":"DropDown","data":{"":"El componente DropDown es un componente que muestra un seudo submenu.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente DropDown, se puede hacer desde fenextjs o fenextjs-component\nimport { DropDown, DropDownProps } from \"fenextjs/cjs/component/DropDown\";\no\nimport { DropDown, DropDownProps } from \"fenextjs-component/cjs/DropDown\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tloader\tboolean\tno\t\tIndica si el DropDown está actualmente en estado de carga.\tdisabled\tboolean\tno\t\tIndica si el DropDown está deshabilitado o no.\tdefaultActive\tboolean\tno\t\tIndica si el DropDown está activo por defecto para mostrar.\tactive\tboolean\tno\t\tIndica si el DropDown está activo para mostrar.\tname\tstring\tno\t\tEl nombre para el DropDown.\ttype\t\"radio\" | \"checkbox\"\tno\t\tTipo de collapse. Puede ser \"radio\" o \"checkbox\".\tshow\t\"checked\" | \"focus\"\tno\t\tTipo de forma para mostrar el collapse. Puede ser \"checked\" o \"focus\".\theader\tReactNode\tsí\t\tEncabezado del DropDown.\tonChange\t(value: boolean) => void\tno\t\tFunción de cambio del DropDown.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente DropDown\n<DropDown\n  loader={false}\n  disabled={false}\n  defaultActive={false}\n  active={true}\n  name=\"exampleCollapse\"\n  status=\"ok\"\n  type=\"checkbox\"\n  show=\"focus\"\n  header={<HeaderComponent />}\n  onChange={(value) =>\n    console.log(`Collapse cambiado a ${value ? \"activo\" : \"inactivo\"}`)\n  }\n>\n  Contenido del DropDown\n</DropDown>"}},"/components/error-component":{"title":"ErrorComponent","data":{"":"El componente ErrorComponent es un componente que muestra un error de ErrorFenextjs.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ErrorComponent, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ErrorComponent,\n  ErrorComponentProps,\n} from \"fenextjs/cjs/component/Error\";\no\nimport {\n  ErrorComponent,\n  ErrorComponentProps,\n} from \"fenextjs-component/cjs/Error\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\terror\tErrorFenextjs\tno\t\tError del componente.\tchildren\tReactNode\tno\t\tContenido para mostrar si no se usa el parametro error","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ErrorComponent\n<ErrorComponent error={new ErrorFenextjs()}>\n  Contenido del ErrorComponent\n</ErrorComponent>"}},"/components/from":{"title":"From","data":{"":"El componente From es un componente que sirve para gestionar formularios.","importacion#Importacion":"Para importar el componente From, se puede hacer desde fenextjs o fenextjs-component\nimport { From, FromProps } from \"fenextjs/cjs/component/From\";\no\nimport { From, FromProps } from \"fenextjs-component/cjs/From\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tid\tstring\tNo\t\tEl ID del formulario.\tdata\tD\tSí\t\tLos datos iniciales del formulario.\tonSubmit\tRequestProps<D, R, E, T>\tNo\t\tFunción para manejar la presentación del formulario.\tonAfterSubmit\t(data: RequestResultDataProps<R, E, T>) => void\tNo\t\tFunción a llamar después de una presentación exitosa del formulario.\tdisabled\tboolean\tNo\t\tIndica si el formulario está deshabilitado.\tonChangeDisable\t(disabled: boolean) => void\tNo\t\tFunción a llamar cuando cambia el estado deshabilitado del formulario.\tloader\tboolean\tNo\t\tIndica si se debe mostrar un cargador mientras el formulario se está presentando.\tonChangeLoader\t(disabled: boolean) => void\tNo\t\tFunción a llamar cuando cambia el estado del cargador del formulario.\tyup\tObjectSchema<AnyObject, AnyObject, any, \"\">\tNo\t\tEl esquema Yup a utilizar para la validación del formulario.\tvalidateAfterYup\tRequestProps<D, R, E, T>\tNo\t\tFunción para manejar la validación del formulario después de validar con Yup.\tclassName\tstring\tNo\t\"\"\tClase CSS para aplicar al elemento del formulario.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente From\n<From>Contenido del From</From>"}},"/components/grid-gallery":{"title":"GridGallery","data":{"":"El componente GridGallery es un componente que sirve para mostrar una grid de componentes.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente GridGallery, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  GridGallery,\n  GridGalleryProps,\n} from \"fenextjs/cjs/component/GridGallery\";\no\nimport {\n  GridGallery,\n  GridGalleryProps,\n} from \"fenextjs-component/cjs/GridGallery\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\titems\tReact.ReactNode[]\tSí\t\tLos elementos para el componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente GridGallery\n<GridGallery items={[<>Elemento 1</>, <>Elemento 2</>, <>Elemento 3</>]} />"}},"/components/header":{"title":"ButtonMenu","data":{"":"El componente ButtonMenu es un componente que muestra un botton que permite interactuar con el menu (menu izquierdo).","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ButtonMenu, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ButtonMenu,\n  ButtonMenuProps,\n} from \"fenextjs/cjs/component/Header/ButtonMenu\";\no\nimport {\n  ButtonMenu,\n  ButtonMenuProps,\n} from \"fenextjs-component/cjs/Header/ButtonMenu\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tNo\t\tIndica si el botón está actualmente en estado de carga.\tdisabled\tboolean\tNo\t\tIndica si el botón está desactivado o no.\tchildren\tReactNode\tno\t\tContenido del componente.\tdefaultActive\tboolean\tNo\t\tIndica si el botón está por defecto activo para mostrar.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ButtonMenu\n<ButtonMenu>Contenido del ButtonMenu</ButtonMenu>"}},"/components/header/button-menu":{"title":"ButtonMenu","data":{"":"El componente ButtonMenu es un componente que muestra un botton que permite interactuar con el menu (menu izquierdo).","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ButtonMenu, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ButtonMenu,\n  ButtonMenuProps,\n} from \"fenextjs/cjs/component/Header/ButtonMenu\";\no\nimport {\n  ButtonMenu,\n  ButtonMenuProps,\n} from \"fenextjs-component/cjs/Header/ButtonMenu\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tNo\t\tIndica si el botón está actualmente en estado de carga.\tdisabled\tboolean\tNo\t\tIndica si el botón está desactivado o no.\tchildren\tReactNode\tno\t\tContenido del componente.\tdefaultActive\tboolean\tNo\t\tIndica si el botón está por defecto activo para mostrar.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ButtonMenu\n<ButtonMenu>Contenido del ButtonMenu</ButtonMenu>"}},"/components/header/item-menu":{"title":"ItemMenu","data":{"":"El componente ItemMenu es un componente que muestra un elemento del menu.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ItemMenu, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ItemMenu,\n  ItemMenuProps,\n} from \"fenextjs/cjs/component/Header/ItemMenu\";\no\nimport {\n  ItemMenu,\n  ItemMenuProps,\n} from \"fenextjs-component/cjs/Header/ItemMenu\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\turl\tstring\tSí\t\tURL de la página en el elemento del menú.\ttext\tReactNode\tSí\t\tTexto de la página en el elemento del menú.\ticon\tReactNode\tNo\t\tIcono de la página en el elemento del menú.\tsubItems\tOmit<ItemMenuProps, \"_t\">[]\tNo\t\tSubpáginas en el elemento del menú.\tdefaultActive\tboolean\tNo\t\tIndica si el elemento del menú está por defecto activo para mostrar.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ItemMenu\n<ItemMenu url=\"/\" text=\"Link\" />"}},"/components/header/menu":{"title":"Menu","data":{"":"El componente Menu es un componente que muestra un menu.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Menu, se puede hacer desde fenextjs o fenextjs-component\nimport { Menu, MenuProps } from \"fenextjs/cjs/component/Header/Menu\";\no\nimport { Menu, MenuProps } from \"fenextjs-component/cjs/Header/Menu\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\titems\tItemMenuProps[]\tNo\t\tLos elementos del menú.\tclassName\tstring\tNo\t\tLa clase CSS para el componente.\tdefaultShowSubMenu\tboolean\tNo\tfalse\tIndica si el submenú se muestra por defecto en el componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Menu\n<Menu\n  items={[\n    {\n      url: \"/\",\n      text: \"Link\",\n    },\n  ]}\n/>"}},"/components/img-gallery":{"title":"ImgGallery","data":{"":"El componente ImgGallery es un componente que muestra galeria de imagenes.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ImgGallery, se puede hacer desde fenextjs o fenextjs-component\nimport { ImgGallery, ImgGalleryProps } from \"fenextjs/cjs/component/ImgGallery\";\no\nimport { ImgGallery, ImgGalleryProps } from \"fenextjs-component/cjs/ImgGallery\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\timgs\tImgProps[]\tSí\t\tLista de imágenes.\tbuttonShowMoreImg\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón para mostrar más imágenes.\tbuttonHiddenMoreImg\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón para ocultar más imágenes.\tloader\tboolean\tNo\t\tIndica si la galería de imágenes está en estado de carga.\tnLoader\tnumber\tNo\t5\tNúmero de elementos cargadores.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ImgGallery\n<ImgGallery\n  imgs={[\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/273/27387.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/409/40949.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images4.alphacoders.com/585/58534.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/768/76885.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images4.alphacoders.com/672/67298.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/176/176767.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images.alphacoders.com/145/145923.jpg\",\n    },\n  ]}\n/>"}},"/components/img-slider":{"title":"ImgSlider","data":{"":"El componente ImgSlider es un componente que muestra un slider de imagenes.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ImgSlider, se puede hacer desde fenextjs o fenextjs-component\nimport { ImgSlider, ImgSliderProps } from \"fenextjs/cjs/component/ImgSlider\";\no\nimport { ImgSlider, ImgSliderProps } from \"fenextjs-component/cjs/ImgSlider\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\timgs\tImgProps[]\tSí\t\tLista de imágenes.\tstep\tnumber\tNo\t\tPaso de la imagen.\tsetStep\t(e: number) => void\tNo\t\tFunción para establecer el paso de la imagen.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ImgSlider\n<ImgSlider\n  imgs={[\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/273/27387.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/409/40949.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images4.alphacoders.com/585/58534.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/768/76885.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images4.alphacoders.com/672/67298.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images3.alphacoders.com/176/176767.jpg\",\n    },\n    {\n      name: \"Img\",\n      src: \"https://images.alphacoders.com/145/145923.jpg\",\n    },\n  ]}\n/>"}},"/components/img":{"title":"Img","data":{"":"El componente Img es un componente que muestra una imagen con configuraciones especiales.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Img, se puede hacer desde fenextjs o fenextjs-component\nimport { Img, ImgProps } from \"fenextjs/cjs/component/Img\";\no\nimport { Img, ImgProps } from \"fenextjs-component/cjs/Img\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tid\tstring | number\tNo\t\tEl ID de la imagen.\tname\tstring\tNo\t\tEl nombre de la imagen.\tsrc\tstring\tSí\t\tURL de la imagen.\tsrcMin1920\tstring\tNo\t\tURL de la imagen para tamaño 1920px o superior.\tsrcMin1680\tstring\tNo\t\tURL de la imagen para tamaño 1680px o superior.\tsrcMin1440\tstring\tNo\t\tURL de la imagen para tamaño 1440px o superior.\tsrcMin1024\tstring\tNo\t\tURL de la imagen para tamaño 1024px o superior.\tsrcMin992\tstring\tNo\t\tURL de la imagen para tamaño 992px o superior.\tsrcMin768\tstring\tNo\t\tURL de la imagen para tamaño 768px o superior.\tsrcMin575\tstring\tNo\t\tURL de la imagen para tamaño 575px o superior.\tsrcThumbnail_200\tstring\tNo\t\tURL de la imagen para miniatura de 200x200px o superior.\tsrcThumbnail_100\tstring\tNo\t\tURL de la imagen para miniatura de 100x100px o superior.\timgIf404\tstring\tNo\t\tURL de la imagen si no se carga la imagen principal.\tlayers\tPick<React.CSSProperties, \"background\" | \"mixBlendMode\" | \"filter\" | \"opacity\">[]\tNo\t\tCapas para la imagen.\tonErrorImg\t(e: SyntheticEvent<HTMLImageElement, Event>) => void\tNo\t\tFunción a llamar en caso de error al cargar la imagen.\tonClick\t() => void\tNo\t\tFunción a llamar al hacer clic en la imagen.\tloader\tboolean\tNo\t\tIndica si la imagen está actualmente en estado de carga.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Img\n<Img\n  name=\"Img\"\n  src=\"https://www.aerocivil.gov.co/Style%20Library/CEA/img/01.jpg\"\n  srcMin768=\"https://www.aerocivil.gov.co/Style%20Library/CEA/img/02.jpg\"\n  srcMin1024=\"https://www.aerocivil.gov.co/Style%20Library/CEA/img/03.jpg\"\n/>"}},"/components/input":{"title":"Input","data":{"":"Fenextjs posee distintos componentes para usar distintos tipos de inputs:\nCard\nInputCardCCV\nInputCardNumber\nInputCheckbox\nInputCode\nInputDate\nInputDateRange\nInputFile\nInputGallery\nGoogle\nInputGoogleAutocomplete\nInputGoogleLoadScript\nInputGoogleMaps\nInputImg\nInputNumber\nInputNumberCount\nInputPassword\nInputPhone\nInputRadio\nInputRange\nInputRate\nInputSearch\nInputSelect\nInputSelectCountry\nInputSelectCountryMultiple\nInputSelectCSC\nInputSelectMultiple\nInputSelectNumber\nInputSelectOption\nInputSwich\nInputText\nInputTextSelect\nUnit\nInputUnitBase\nInputUnitDistance\nInputUnitVolumen\nInputUnitWeight\nInputUpload"}},"/components/input/checkbox":{"title":"InputCheckbox","data":{"":"El componente InputCheckbox es un componente que muestra un checkbox personalizado.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente InputCheckbox, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  InputCheckbox,\n  InputCheckboxProps,\n} from \"fenextjs/cjs/component/Input/Checkbox\";\no\nimport {\n  InputCheckbox,\n  InputCheckboxProps,\n} from \"fenextjs-component/cjs/Input/Checkbox\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDefault\tDescripción\tlabel\tany\tNo\t\tLa etiqueta que se mostrará junto al checkbox.\tlabelPosition\t\"right\" | \"left\"\tNo\t\tLa posición de la etiqueta con respecto al checkbox. Puede ser \"right\" (derecha) o \"left\" (izquierda).\tname\tstring\tNo\t\tEl atributo de nombre del elemento de entrada del checkbox.\tonChange\t(e: boolean) => void\tNo\t\tUna función de devolución de llamada para ejecutar cuando se cambia el estado del checkbox. Recibe un valor booleano que indica si el checkbox está marcado o no.\tdefaultValue\tboolean\tNo\t\tEl valor predeterminado del checkbox cuando se renderiza por primera vez.\tuseValue\tboolean\tNo\t\tUn valor booleano que indica si se debe usar el atributo de valor del elemento de entrada del checkbox o no.\tvalue\tboolean\tNo\t\tEl valor del elemento de entrada del checkbox.\tdisabled\tboolean\tNo\t\tUn valor booleano que indica si el checkbox está desactivado o no.\tonValidateCheck\t() => Promise<void> | void\tNo\t\tUna función de devolución de llamada para ejecutar cuando se valida el checkbox. Debe devolver una promesa o void.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente InputCheckbox\n<InputCheckbox />"}},"/components/lava-lamp":{"title":"LavaLamp","data":{"":"El componente LavaLamp es un componente que muestra background simulando una lampara de lava.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LavaLamp, se puede hacer desde fenextjs o fenextjs-component\nimport { LavaLamp, LavaLampProps } from \"fenextjs/cjs/component/LavaLamp\";\no\nimport { LavaLamp, LavaLampProps } from \"fenextjs-component/cjs/LavaLamp\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tnItems\tnumber\tNo\t\tNúmero de elementos.\tstyles\tCSSProperties\tNo\t\tEstilos generales para los elementos.\tranges\tLavaLampRangeStylesProps\tNo\t\tEstilos específicos para diferentes rangos en la lámpara de lava.\tstylesElement\tLavaLampStylesElement[]\tNo\t\tEstilos para elementos individuales en la lámpara de lava.","lavalampstyleselement#LavaLampStylesElement":"Propiedad\tTipo\tDescripcion\tborderRadius\tCSSProperties['borderRadius']\tEl radio de borde del elemento.\taspectRatio\tCSSProperties['aspectRatio']\tLa relación de aspecto del elemento.\twidth\tCSSProperties['width']\tEl ancho del elemento.\tbackground\tCSSProperties['background']\tEl fondo del elemento.\tanimationTimingFunction\tCSSProperties['animationTimingFunction']\tLa función de temporización de la animación del elemento.","lavalamprangestylesprops#LavaLampRangeStylesProps":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\ttop\tLavaLampGetNumberRandomProps\tNo\t\tRango para el estilo top (posición vertical).\tleft\tLavaLampGetNumberRandomProps\tNo\t\tRango para el estilo left (posición horizontal).\tscale\tLavaLampGetNumberRandomProps\tNo\t\tRango para el estilo scale (escala).\tmoveX\tLavaLampGetNumberRandomProps\tNo\t\tRango para el estilo moveX (movimiento horizontal).\tmoveY\tLavaLampGetNumberRandomProps\tNo\t\tRango para el estilo moveY (movimiento vertical).\ttime\tLavaLampGetNumberRandomProps\tNo\t\tRango para el estilo time (tiempo de animación).","lavalampgetnumberrandomprops#LavaLampGetNumberRandomProps":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tmin\tnumber\tSí\t\tEl número mínimo para generar un número aleatorio.\tmax\tnumber\tSí\t\tEl número máximo para generar un número aleatorio.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LavaLamp\n<LavaLamp />"}},"/components/layout":{"title":"LayoutGridMenuLeft","data":{"":"El componente LayoutGridMenuLeft es un componente que muestra un layout con un menu a la izquierda.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LayoutGridMenuLeft, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LayoutGridMenuLeft,\n  LayoutGridMenuLeftProps,\n} from \"fenextjs/cjs/component/Layout/Grid/GridMenuLeft\";\no\nimport {\n  LayoutGridMenuLeft,\n  LayoutGridMenuLeftProps,\n} from \"fenextjs-component/cjs/Layout/Grid/GridMenuLeft\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tNo\t\tIndica si la página está actualmente en estado de carga.\tmenuLeft\tReactNode\tNo\t\tMenú izquierdo del diseño.\tmenuLeftActive\tboolean\tNo\t\tIndica si el menú izquierdo está activo en el diseño.\tmenuLeftMovilActive\tboolean\tNo\t\tIndica si el menú izquierdo móvil está activo en el diseño.\tuseHeaderButtonMenu\tboolean\tNo\t\tUtilizar botón de menú en el encabezado para mostrar el menú.\tusePageProgress\tboolean\tNo\t\tUtilizar barra de progreso de página.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LayoutGridMenuLeft\n<LayoutGridMenuLeft\n  menuLeft={\n    <>\n      <h3>It is Menu Left</h3>\n    </>\n  }\n>\n  <>\n    <h1>It is Body</h1>\n    <p>\n      Lorem ipsum dolor, sit amet consectetur adipisicing elit. Aperiam\n      laboriosam qui expedita nostrum facere consequuntur labore blanditiis\n      perspiciatis ducimus est, iure dolorem nesciunt numquam modi hic, sit\n      repellat at iste?\n    </p>\n  </>\n</LayoutGridMenuLeft>"}},"/components/layout/layout-grid-menu-left":{"title":"LayoutGridMenuLeft","data":{"":"El componente LayoutGridMenuLeft es un componente que muestra un layout con un menu a la izquierda.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LayoutGridMenuLeft, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LayoutGridMenuLeft,\n  LayoutGridMenuLeftProps,\n} from \"fenextjs/cjs/component/Layout/Grid/GridMenuLeft\";\no\nimport {\n  LayoutGridMenuLeft,\n  LayoutGridMenuLeftProps,\n} from \"fenextjs-component/cjs/Layout/Grid/GridMenuLeft\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tNo\t\tIndica si la página está actualmente en estado de carga.\tmenuLeft\tReactNode\tNo\t\tMenú izquierdo del diseño.\tmenuLeftActive\tboolean\tNo\t\tIndica si el menú izquierdo está activo en el diseño.\tmenuLeftMovilActive\tboolean\tNo\t\tIndica si el menú izquierdo móvil está activo en el diseño.\tuseHeaderButtonMenu\tboolean\tNo\t\tUtilizar botón de menú en el encabezado para mostrar el menú.\tusePageProgress\tboolean\tNo\t\tUtilizar barra de progreso de página.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LayoutGridMenuLeft\n<LayoutGridMenuLeft\n  menuLeft={\n    <>\n      <h3>It is Menu Left</h3>\n    </>\n  }\n>\n  <>\n    <h1>It is Body</h1>\n    <p>\n      Lorem ipsum dolor, sit amet consectetur adipisicing elit. Aperiam\n      laboriosam qui expedita nostrum facere consequuntur labore blanditiis\n      perspiciatis ducimus est, iure dolorem nesciunt numquam modi hic, sit\n      repellat at iste?\n    </p>\n  </>\n</LayoutGridMenuLeft>"}},"/components/layout/layout-grid-menu-top-left":{"title":"LayoutGridMenuTopLeft","data":{"":"El componente LayoutGridMenuTopLeft es un componente que muestra un layout con un menu arriba y a la izquierda.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LayoutGridMenuTopLeft, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LayoutGridMenuTopLeft,\n  LayoutGridMenuTopLeftProps,\n} from \"fenextjs/cjs/component/Layout/Grid/GridMenuTopLeft\";\no\nimport {\n  LayoutGridMenuTopLeft,\n  LayoutGridMenuTopLeftProps,\n} from \"fenextjs-component/cjs/Layout/Grid/GridMenuTopLeft\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tmenuLeft\tReactNode\tNo\t\tMenú izquierdo del diseño.\tmenuLeftActive\tboolean\tNo\t\tIndica si el menú izquierdo está activo en el diseño.\tmenuLeftMovilActive\tboolean\tNo\t\tIndica si el menú izquierdo móvil está activo en el diseño.\tuseHeaderButtonMenu\tboolean\tNo\t\tUtilizar botón de menú en el encabezado para mostrar el menú.\tloader\tboolean\tNo\t\tIndica si la página está actualmente en estado de carga.\tmenuTop\tReactNode\tNo\t\tMenú superior del diseño.\tusePageProgress\tboolean\tNo\t\tUtilizar barra de progreso de página.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LayoutGridMenuTopLeft\n<LayoutGridMenuTopLeft\n  menuTop={\n    <>\n      <h3>It is Menu Top</h3>\n    </>\n  }\n  menuLeft={\n    <>\n      <h3>It is Menu Left</h3>\n    </>\n  }\n>\n  <>\n    <h1>It is Body</h1>\n    <p>\n      Lorem ipsum dolor, sit amet consectetur adipisicing elit. Aperiam\n      laboriosam qui expedita nostrum facere consequuntur labore blanditiis\n      perspiciatis ducimus est, iure dolorem nesciunt numquam modi hic, sit\n      repellat at iste?\n    </p>\n  </>\n</LayoutGridMenuTopLeft>"}},"/components/layout/layout-grid-menu-top":{"title":"LayoutGridMenuTop","data":{"":"El componente LayoutGridMenuTop es un componente que muestra un layout con un menu arriba.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LayoutGridMenuTop, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LayoutGridMenuTop,\n  LayoutGridMenuTopProps,\n} from \"fenextjs/cjs/component/Layout/Grid/GridMenuTop\";\no\nimport {\n  LayoutGridMenuTop,\n  LayoutGridMenuTopProps,\n} from \"fenextjs-component/cjs/Layout/Grid/GridMenuTop\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tloader\tboolean\tNo\t\tIndica si la página está actualmente en estado de carga.\tmenuTop\tReactNode\tNo\t\tMenú superior del diseño.\tusePageProgress\tboolean\tNo\t\tUtilizar barra de progreso de página.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LayoutGridMenuTop\n<LayoutGridMenuTop\n  menuTop={\n    <>\n      <h3>It is Menu Top</h3>\n    </>\n  }\n>\n  <>\n    <h1>It is Body</h1>\n    <p>\n      Lorem ipsum dolor, sit amet consectetur adipisicing elit. Aperiam\n      laboriosam qui expedita nostrum facere consequuntur labore blanditiis\n      perspiciatis ducimus est, iure dolorem nesciunt numquam modi hic, sit\n      repellat at iste?\n    </p>\n  </>\n</LayoutGridMenuTop>"}},"/components/link":{"title":"Link","data":{"":"El componente Link es un componente que muestra un link <a>.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Link, se puede hacer desde fenextjs o fenextjs-component\nimport { Link, LinkProps } from \"fenextjs/cjs/component/Link\";\no\nimport { Link, LinkProps } from \"fenextjs-component/cjs/Link\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tchildren\tReactNode\tNo\t\tContenido del enlace.\thref\tLinkNextProps['href'] | string\tSí\t\tLa URL del enlace.\tas\tLinkNextProps['as']\tNo\t\tEl valor de as para el enlace Next.js.\treplace\tLinkNextProps['replace']\tNo\t\tIndica si el enlace debe reemplazar la entrada del historial.\tscroll\tLinkNextProps['scroll']\tNo\t\tControla si el enlace debe activar el desplazamiento suave.\tshallow\tLinkNextProps['shallow']\tNo\t\tHabilita la navegación superficial para el enlace.\tpassHref\tLinkNextProps['passHref']\tNo\t\tIndica si se debe pasar la propiedad href al componente enlazado.\ttarget\tAnchorHTMLAttributes<HTMLAnchorElement>['target']\tNo\t\tDefine la propiedad target del enlace HTML.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Link\n<Link href=\"#\">Hola</Link>"}},"/components/loader":{"title":"Loader","data":{"":"El componente Loader es un componente que muestra un loader simple.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Loader, se puede hacer desde fenextjs o fenextjs-component\nimport { Loader, LoaderProps } from \"fenextjs/cjs/component/Loader\";\no\nimport { Loader, LoaderProps } from \"fenextjs-component/cjs/Loader\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tclassNameLoader\tstring\tNo\t\tClase personalizada del loader.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Loader\n<Loader />"}},"/components/loader/line":{"title":"LoaderLine","data":{"":"El componente LoaderLine es un componente que muestra un loader de linea simple.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LoaderLine, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LoaderLine,\n  LoaderLineProps,\n} from \"fenextjs/cjs/component/Loader/Line\";\no\nimport {\n  LoaderLine,\n  LoaderLineProps,\n} from \"fenextjs-component/cjs/Loader/Line\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\theight\tnumber\tNo\t\tAltura de la linea\tclassNameLoaderLine\tstring\tNo\t\tClase personalizada del loader.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LoaderLine\n<LoaderLine />"}},"/components/loader/spinner":{"title":"LoaderSpinner","data":{"":"El componente LoaderSpinner es un componente que muestra un loader de spinner simple.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LoaderSpinner, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LoaderSpinner,\n  LoaderSpinnerProps,\n} from \"fenextjs/cjs/component/Loader/Spinner\";\no\nimport {\n  LoaderSpinner,\n  LoaderSpinnerProps,\n} from \"fenextjs-component/cjs/Loader/Spinner\";","parametros#Parametros":"| Parametro | Tipo | Requerido | Default | Descripcion |\n| classNameLoaderSpinner | string | No | | Clase personalizada del loader. |","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LoaderSpinner\n<LoaderSpinner />"}},"/components/loader/user":{"title":"LoaderUser","data":{"":"El componente LoaderUser es un componente que muestra un loader de usuario simple.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente LoaderUser, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  LoaderUser,\n  LoaderUserProps,\n} from \"fenextjs/cjs/component/Loader/User\";\no\nimport {\n  LoaderUser,\n  LoaderUserProps,\n} from \"fenextjs-component/cjs/Loader/User\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tclassNameLoaderUser\tstring\tNo\t\tClase personalizada del loader.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente LoaderUser\n<LoaderUser />"}},"/components/media":{"title":"MediaInput","data":{"":"El componente MediaInput es un componente que muestra un input media para gestionar archivos.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente MediaInput, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  MediaInput,\n  MediaInputProps,\n} from \"fenextjs/cjs/component/Media/Input\";\no\nimport {\n  MediaInput,\n  MediaInputProps,\n} from \"fenextjs-component/cjs/Media/Input\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\ttitleView\tstring\tNo\t\tTítulo de la vista del componente.\ttextView\tstring\tNo\t\tTexto de la vista del componente.\ticonView\tReactNode\tNo\t\tIcono de la vista del componente.\tdefaultValue\tImgDataProps[] | ImgDataProps\tNo\t\tValor predeterminado del componente.\tmultiple\tboolean\tNo\t\tIndica si se permiten múltiples elementos.\tonChange\t(data: ImgDataProps[] | ImgDataProps | undefined) => void\tNo\t\tFunción a llamar cuando cambia el valor del componente.\tButtonUploadProps\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón de carga para el componente.\tMediaPageProps\tOmit<MediaPageProps, \"onChange\" | \"multiple\" | \"defaultValue\">\tNo\t\tPropiedades de la página de medios para el componente.\tModalProps\tPick<ModalBaseBaseProps, \"type\">\tNo\t\tPropiedades del modal para el componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente MediaInput\n<MediaInput />"}},"/components/media/input":{"title":"MediaInput","data":{"":"El componente MediaInput es un componente que muestra un input media para gestionar archivos.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente MediaInput, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  MediaInput,\n  MediaInputProps,\n} from \"fenextjs/cjs/component/Media/Input\";\no\nimport {\n  MediaInput,\n  MediaInputProps,\n} from \"fenextjs-component/cjs/Media/Input\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\ttitleView\tstring\tNo\t\tTítulo de la vista del componente.\ttextView\tstring\tNo\t\tTexto de la vista del componente.\ticonView\tReactNode\tNo\t\tIcono de la vista del componente.\tdefaultValue\tImgDataProps[] | ImgDataProps\tNo\t\tValor predeterminado del componente.\tmultiple\tboolean\tNo\t\tIndica si se permiten múltiples elementos.\tonChange\t(data: ImgDataProps[] | ImgDataProps | undefined) => void\tNo\t\tFunción a llamar cuando cambia el valor del componente.\tButtonUploadProps\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón de carga para el componente.\tMediaPageProps\tOmit<MediaPageProps, \"onChange\" | \"multiple\" | \"defaultValue\">\tNo\t\tPropiedades de la página de medios para el componente.\tModalProps\tPick<ModalBaseBaseProps, \"type\">\tNo\t\tPropiedades del modal para el componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente MediaInput\n<MediaInput />"}},"/components/media/page":{"title":"MediaPage","data":{"":"El componente MediaPage es un componente que muestra un pagina de media para gestionar archivos.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente MediaPage, se puede hacer desde fenextjs o fenextjs-component\nimport { MediaPage, MediaPageProps } from \"fenextjs/cjs/component/Media/Page\";\no\nimport { MediaPage, MediaPageProps } from \"fenextjs-component/cjs/Media/Page\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tdefaultValue\tImgDataProps[] | ImgDataProps\tNo\t\tValor predeterminado del componente.\tdisabledSelectImg\tboolean\tNo\t\tIndica si la selección de imágenes está deshabilitada.\timages\tImgDataProps[]\tNo\t\tLista de imágenes para el componente.\tloaderImages\tboolean\tNo\t\tIndica si la carga de imágenes está en estado de carga.\tmultiple\tboolean\tNo\t\tIndica si se permiten múltiples imágenes.\tisPage\tboolean\tNo\t\tIndica si la vista es una página.\tonRenderImg\t(data: ImgDataProps) => ReactNode\tNo\t\tFunción para renderizar una imagen en la vista.\tonChange\t(data: ImgDataProps[] | ImgDataProps | undefined) => void\tNo\t\tFunción a llamar cuando cambia la selección de imágenes.\tonUploadImg\t(data: ImgDataProps) => void\tNo\t\tFunción a llamar cuando se carga una nueva imagen.\tonDeleteImg\t(data: ImgDataProps) => void\tNo\t\tFunción a llamar cuando se elimina una imagen.\tonAcepte\t(data: ImgDataProps[] | ImgDataProps) => void\tNo\t\tFunción a llamar cuando se acepta la selección de imágenes.\tHeaderPage\tReactNode\tNo\t\tElemento de encabezado para la página de medios.\tButtonAcceptProps\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón de aceptar para la página.\tButtonCancelProps\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón de cancelar para la página.\tInputUploadProps\tOmit<InputUploadProps, \"onChange\" | \"defaultValue\" | \"onChangeProgress\" | \"onUploadFile\" | \"clearAfterUpload\">\tNo\t\tPropiedades del componente de carga de archivos.\textraContentImgs\tReactNode\tNo\t\tContenido adicional para las imágenes en la página.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente MediaPage\n<MediaPage />"}},"/components/modal":{"title":"Modal","data":{"":"El componente Modal es un componente que muestra una modal.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Modal, se puede hacer desde fenextjs o fenextjs-component\nimport { Modal, ModalProps } from \"fenextjs/cjs/component/Modal/Modal\";\no\nimport { Modal, ModalProps } from \"fenextjs-component/cjs/Modal/Modal\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tchildren\tReactNode\tSí\t\tContenido del modal.\ttype\t \"top\" | \"left\" | \"right\" | \"bottom\" | \"center\" | \"full\" | \"layout-grid\"\tNo\t\tTipo de modal.\tactive\tboolean\tNo\t\tIndica si el modal está activo.\tonClose\t() => void\tNo\t\tFunción a llamar cuando se cierra el modal.\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tElementActionModalActive\tReactNode\tNo\t\tElemento con onClick para activar el modal.\tonActive\t() => void\tNo\t\tFunción a llamar cuando se activa el modal.\tclassName\tstring\tNo\t\tClase personalizada para el modal.\tstyle\tCSSProperties\tNo\t\tEstilos personalizados para el modal.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Modal\n<Modal />"}},"/components/modal/base":{"title":"ModalBase","data":{"":"El componente ModalBase es un componente que muestra una modal.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ModalBase, se puede hacer desde fenextjs o fenextjs-component\nimport { ModalBase, ModalBaseProps } from \"fenextjs/cjs/component/Modal/Base\";\no\nimport { ModalBase, ModalBaseProps } from \"fenextjs-component/cjs/Modal/Base\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tactive\tboolean\tNo\t\tIndica si el modal está activo.\ttype\t \"top\" | \"left\" | \"right\" | \"bottom\" | \"center\" | \"full\" | \"layout-grid\"\tNo\t\tTipo de modal.\tonClose\t() => void\tNo\t\tFunción a llamar cuando se cierra el modal.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ModalBase\n<ModalBase />"}},"/components/notification":{"title":"Notification","data":{"":"El componente Notification es un componente que muestra una notificacion.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Notification, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  Notification,\n  NotificationProps,\n} from \"fenextjs/cjs/component/Notification\";\no\nimport {\n  Notification,\n  NotificationProps,\n} from \"fenextjs-component/cjs/Notification\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tchildren\tReactNode\tNo\t\tContenido de la notificación.\ttype\tRequestResultTypeProps\tNo\t\tTipo de notificación. Puede ser success, error, info o warning.\t_t\tstring\tNo\t\tPropiedad de internacionalización.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Notification\n<Notification />"}},"/components/notification/pop":{"title":"NotificationPop","data":{"":"El componente NotificationPop es un componente que muestra una notificacion que se activa con el hook useNotification.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente NotificationPop, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  NotificationPop,\n  NotificationPopProps,\n} from \"fenextjs/cjs/component/Notification/Pop\";\no\nimport {\n  NotificationPop,\n  NotificationPopProps,\n} from \"fenextjs-component/cjs/Notification/Pop\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\ttypePop\t\"top\" | \"down\"\tNo\t\tTipo de notificación emergente. Puede ser top o down.\tposition\tNotificationPositionProps\tNo\t\tPosición de la notificación emergente.\ttimeout\tnumber\tNo\t\tDuración en milisegundos para mostrar la notificación emergente.\tclassName\tstring\tNo\t\tClase personalizada para la notificación emergente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente NotificationPop\n<NotificationPop />"}},"/components/page-progress":{"title":"PageProgress","data":{"":"El componente PageProgress es un componente que muestra una barra de progreso al cargar paginas.","importacion#Importacion":"Para importar el componente PageProgress, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  PageProgress,\n  PageProgressProps,\n} from \"fenextjs/cjs/component/PageProgress\";\no\nimport {\n  PageProgress,\n  PageProgressProps,\n} from \"fenextjs-component/cjs/PageProgress\";","usos#Usos":"Uso básico del componente PageProgress\n<PageProgress />"}},"/components/pagination":{"title":"Pagination","data":{"":"El componente Pagination es un componente que muestra una paginacion.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Pagination, se puede hacer desde fenextjs o fenextjs-component\nimport { Pagination, PaginationProps } from \"fenextjs/cjs/component/Pagination\";\no\nimport { Pagination, PaginationProps } from \"fenextjs-component/cjs/Pagination\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tdefaultPage\tnumber\tNo\t\tPágina predeterminada a mostrar al cargar el componente.\tnItems\tnumber\tSí\t\tNúmero total de elementos para paginar.\tnItemsPage\tnumber\tNo\t\tNúmero de elementos para mostrar por página.\tdisabled\tboolean\tNo\t\tIndica si el componente está deshabilitado.\thiddenIfNItemsSmallerThanOrEqualNItemsPage\tboolean\tNo\tfalse\tOcultar la paginación si nItems es menor o igual que nItemsPage.\tonChangePage\t(page: number) => void\tNo\t\tFunción de devolución de llamada que se llama cuando cambia la página.\tlistNpage\tInputSelectBaseProps['options']\tNo\t\tLista de opciones para seleccionar el número de páginas.\tonChangeNPage\tInputSelectBaseProps['onChange']\tNo\t\tFunción de devolución de llamada cuando cambia el número de páginas seleccionado.\tshowItemPage\tboolean\tNo\t\tIndica si se debe mostrar la paginación de ítems por página.\tshowNPage\tboolean\tNo\t\tIndica si se debe mostrar la paginación del número de páginas.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Pagination\n<Pagination />"}},"/components/pagination/all":{"title":"Pagination","data":{"":"El componente Pagination es un componente que muestra una paginacion.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Pagination, se puede hacer desde fenextjs o fenextjs-component\nimport { Pagination, PaginationProps } from \"fenextjs/cjs/component/Pagination\";\no\nimport { Pagination, PaginationProps } from \"fenextjs-component/cjs/Pagination\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tdefaultPage\tnumber\tNo\t\tPágina predeterminada a mostrar al cargar el componente.\tnItems\tnumber\tSí\t\tNúmero total de elementos para paginar.\tnItemsPage\tnumber\tNo\t\tNúmero de elementos para mostrar por página.\tdisabled\tboolean\tNo\t\tIndica si el componente está deshabilitado.\thiddenIfNItemsSmallerThanOrEqualNItemsPage\tboolean\tNo\tfalse\tOcultar la paginación si nItems es menor o igual que nItemsPage.\tonChangePage\t(page: number) => void\tNo\t\tFunción de devolución de llamada que se llama cuando cambia la página.\tlistNpage\tInputSelectBaseProps['options']\tNo\t\tLista de opciones para seleccionar el número de páginas.\tonChangeNPage\tInputSelectBaseProps['onChange']\tNo\t\tFunción de devolución de llamada cuando cambia el número de páginas seleccionado.\tshowItemPage\tboolean\tNo\t\tIndica si se debe mostrar la paginación de ítems por página.\tshowNPage\tboolean\tNo\t\tIndica si se debe mostrar la paginación del número de páginas.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Pagination\n<Pagination />"}},"/components/pagination/item-page":{"title":"PaginationItemPage","data":{"":"El componente PaginationItemPage es un componente que muestra una paginacion con solo los items(paginas) disponibles.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente PaginationItemPage, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  PaginationItemPage,\n  PaginationItemPageProps,\n} from \"fenextjs/cjs/component/Pagination/PaginationItemPage\";\no\nimport {\n  PaginationItemPage,\n  PaginationItemPageProps,\n} from \"fenextjs-component/cjs/Pagination/PaginationItemPage\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tdefaultPage\tnumber\tNo\t\tPágina predeterminada a mostrar al cargar el componente.\tnItems\tnumber\tSí\t\tNúmero total de elementos para paginar.\tnItemsPage\tnumber\tNo\t\tNúmero de elementos para mostrar por página.\tdisabled\tboolean\tNo\t\tIndica si el componente está deshabilitado.\thiddenIfNItemsSmallerThanOrEqualNItemsPage\tboolean\tNo\tfalse\tOcultar la paginación si nItems es menor o igual que nItemsPage.\tonChangePage\t(page: number) => void\tNo\t\tFunción de devolución de llamada que se llama cuando cambia la página.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente PaginationItemPage\n<PaginationItemPage />"}},"/components/print":{"title":"Print","data":{"":"Fenextjs permite usar un imprimir personalizado usando los componentes\nPrintIframe\nPrintPage"}},"/components/pagination/n-page":{"title":"PaginationNPage","data":{"":"El componente PaginationNPage es un componente que muestra una paginacion con solo el selector de numero de items por pagina.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente PaginationNPage, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  PaginationNPage,\n  PaginationNPageProps,\n} from \"fenextjs/cjs/component/Pagination/PaginationNPage\";\no\nimport {\n  PaginationNPage,\n  PaginationNPageProps,\n} from \"fenextjs-component/cjs/Pagination/PaginationNPage\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tlistNpage\tInputSelectBaseProps['options']\tNo\t\tLista de opciones para seleccionar el número de páginas.\tonChangeNPage\tInputSelectBaseProps['onChange']\tNo\t\tFunción de devolución de llamada cuando cambia el número de páginas seleccionado.\tvalue\tInputSelectBaseProps['value']\tNo\t\tValor seleccionado actualmente del número de páginas.\tdisabled\tInputSelectBaseProps['disabled']\tNo\t\tIndica si el componente está deshabilitado.\tclassName\tInputSelectBaseProps['className']\tNo\t\tClase personalizada para el componente.\tplaceholder\tInputSelectBaseProps['placeholder']\tNo\t\tTexto de marcador de posición para el componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente PaginationNPage\n<PaginationNPage />"}},"/components/print/iframe":{"title":"PrintIframe","data":{"":"El componente PrintIframe es un componente que muestra un iframe que se usa para imprimir una pagina.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente PrintIframe, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  PrintIframe,\n  PrintIframeProps,\n} from \"fenextjs/cjs/component/Print/Iframe\";\no\nimport {\n  PrintIframe,\n  PrintIframeProps,\n} from \"fenextjs-component/cjs/Print/Iframe\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\turlBase\tstring\tNo\t\tURL base para construir la URL completa para imprimir.\turl\tstring\tSí\t\tURL completa para imprimir.\tdata\tT\tNo\t\tDatos a pasar al componente de impresión.\tdelayForPrint\tnumber\tNo\t\tRetraso en milisegundos antes de imprimir.\tonComponent\t(data: PrintIframeComponentProps) => ReactNode\tSí\t\tFunción que devuelve el componente a imprimir.\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tonBeforePrint\t() => void or Promise<void>\tNo\t\tFunción que se ejecuta antes de imprimir.\tonAfterPrint\t() => void or Promise<void>\tNo\t\tFunción que se ejecuta después de imprimir.\tonPrintError\t(error: Error) => void\tNo\t\tFunción que se ejecuta en caso de error de impresión.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente PrintIframe\n<PrintIframe />"}},"/components/print/page":{"title":"PrintPage","data":{"":"El componente PrintPage es un componente que muestra para imprimir como pagina.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente PrintPage, se puede hacer desde fenextjs o fenextjs-component\nimport { PrintPage, PrintPageProps } from \"fenextjs/cjs/component/Print/Page\";\no\nimport { PrintPage, PrintPageProps } from \"fenextjs-component/cjs/Print/Page\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tonComponent\t(data: PrintPageComponentProps<T>) => ReactNode\tSí\t\tFunción que devuelve el componente para la impresión.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente PrintPage\n<PrintPage />"}},"/components/progress":{"title":"Progress","data":{"":"Fenextjs posee distintos componentes para repreceentar un progreso:\nProgressLine\nProgressCircle"}},"/components/progress/circle":{"title":"ProgressCircle","data":{"":"El componente ProgressCircle es un componente que muestra un progreso reprecentado en circulo y porcentaje.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ProgressCircle, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ProgressCircle,\n  ProgressCircleProps,\n} from \"fenextjs/cjs/component/Progress/Circle\";\no\nimport {\n  ProgressCircle,\n  ProgressCircleProps,\n} from \"fenextjs-component/cjs/Progress/Circle\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tp\tnumber\tSí\t\tNúmero de progreso.\tshowP\tboolean\tSí\t\tIndica si se debe mostrar el número de progreso.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ProgressCircle\n<ProgressCircle p={40} showP={true} />"}},"/components/progress/line":{"title":"ProgressLine","data":{"":"El componente ProgressLine es un componente que muestra un progreso reprecentado en linea y porcentaje.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ProgressLine, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ProgressLine,\n  ProgressLineProps,\n} from \"fenextjs/cjs/component/Progress/Line\";\no\nimport {\n  ProgressLine,\n  ProgressLineProps,\n} from \"fenextjs-component/cjs/Progress/Line\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tp\tnumber\tSí\t\tNúmero de progreso.\tshowP\tboolean\tSí\t\tIndica si se debe mostrar el número de progreso.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ProgressLine\n<ProgressLine p={40} showP={true} />"}},"/components/schedule":{"title":"Schedule","data":{"":"Fenextjs posee distintos componentes para repreceentar un schedule:\nScheduleDay\nScheduleWeekly"}},"/components/schedule/day":{"title":"ScheduleDay","data":{"":"El componente ScheduleDay es un componente que muestra un schedule por dia.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ScheduleDay, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ScheduleDay,\n  ScheduleDayProps,\n} from \"fenextjs/cjs/component/Schedule/Day\";\no\nimport {\n  ScheduleDay,\n  ScheduleDayProps,\n} from \"fenextjs-component/cjs/Schedule/Day\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tdefaultValue\tScheduleDayValueType\tNo\t\tValor predeterminado del campo de entrada.\tvalue\tScheduleDayValueType\tNo\t\tValor actual del campo de entrada.\tonChange\t(v: ScheduleDayValueType) => void\tNo\t\tFunción de devolución de llamada para manejar cambios en el campo de entrada.\tminDate\tDate\tNo\t\tFecha mínima permitida para la selección.\tmaxDate\tDate\tNo\t\tFecha máxima permitida para la selección.\tdisabledDates\tDate[] or (date: Date) => boolean\tNo\t\tFechas deshabilitadas para la selección. Puede ser una lista de fechas o una función que toma una fecha y devuelve un valor booleano.\tformat\tstring\tNo\t\tFormato de fecha para mostrar y manejar la entrada. Puede usar tokens como 'yyyy', 'MM', 'dd', 'HH', 'mm', 'ss'.\tshowTodayButton\tboolean\tNo\ttrue\tIndica si se debe mostrar el botón \"Hoy\".\tButtonProps\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón para agregar elementos.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ScheduleDay\n<ScheduleDay />"}},"/components/schedule/weekly":{"title":"ScheduleWeekly","data":{"":"El componente ScheduleWeekly es un componente que muestra un schedule por semana.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente ScheduleWeekly, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  ScheduleWeekly,\n  ScheduleWeeklyProps,\n} from \"fenextjs/cjs/component/Schedule/Weekly\";\no\nimport {\n  ScheduleWeekly,\n  ScheduleWeeklyProps,\n} from \"fenextjs-component/cjs/Schedule/Weekly\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\ttitle\tReactNode\tNo\t\tTítulo de la vista semanal.\tdefaultValue\tScheduleWeeklyValueType\tNo\t\tValor predeterminado del campo de entrada.\tvalue\tScheduleWeeklyValueType\tNo\t\tValor actual del campo de entrada.\tonChange\t(v: ScheduleWeeklyValueType) => void\tNo\t\tFunción de devolución de llamada para manejar cambios en el campo de entrada.\tminDate\tDate\tNo\t\tFecha mínima permitida para la selección.\tmaxDate\tDate\tNo\t\tFecha máxima permitida para la selección.\tdisabledDates\tDate[] or (date: Date) => boolean\tNo\t\tFechas deshabilitadas para la selección. Puede ser una lista de fechas o una función que toma una fecha y devuelve un valor booleano.\tformat\tstring\tNo\t\tFormato de fecha para mostrar y manejar la entrada. Puede usar tokens como 'yyyy', 'MM', 'dd', 'HH', 'mm', 'ss'.\tshowTodayButton\tboolean\tNo\ttrue\tIndica si se debe mostrar el botón \"Hoy\".\tButtonProps\tOmit<ButtonProps, \"onClick\">\tNo\t\tPropiedades del botón para agregar elementos.\tCollapseMultipleProps\tOmit<CollapseMultipleProps, \"items\">\tNo\t\tPropiedades de CollapseMultiple para el campo de entrada.\tonParseHeaderDay\t(v: DaysEnum) => ReactNode\tNo\t\tFunción de devolución de llamada para analizar el encabezado del día.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente ScheduleWeekly\n<ScheduleWeekly />"}},"/components/share":{"title":"Share","data":{"":"El componente Share es un componente que muestra una forma de comporatir un texto en redes sociales.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Share, se puede hacer desde fenextjs o fenextjs-component\nimport { Share, ShareProps } from \"fenextjs/cjs/component/Share\";\no\nimport { Share, ShareProps } from \"fenextjs-component/cjs/Share\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tButtonProps\tButtonProps\tNo\t\tPropiedades del botón para el componente.\tTitleProps\tTitleProps\tNo\t\tPropiedades del título para el componente.\tshare\tstring\tNo\t\tTexto para compartir en el componente.\tshareList\tShareListType[]\tNo\t\tLista de opciones de compartir para el componente.\tshowShareCopy\tboolean\tNo\ttrue\tIndica si se debe mostrar el texto para copiar en el componente.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Share\n<Share />"}},"/components/slider":{"title":"Slider","data":{"":"El componente Slider es un componente que muestra una lista de items en slider.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Slider, se puede hacer desde fenextjs o fenextjs-component\nimport { Slider, SliderProps } from \"fenextjs/cjs/component/Slider\";\no\nimport { Slider, SliderProps } from \"fenextjs-component/cjs/Slider\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\titems\tReactNode[]\tNo\t\tElementos del slider.\tnItemsDesktop\tnumber\tNo\t\tNúmero de elementos en el slider en escritorio.\tnItemsTable\tnumber\tNo\t\tNúmero de elementos en el slider en tablet.\tnItemsPhone\tnumber\tNo\t\tNúmero de elementos en el slider en teléfono.\ttimeDelay\tnumber\tNo\t\tTiempo de retraso entre movimientos del slider.\ttimeAnimation\tnumber\tNo\t\tDuración de la animación al mover el slider.\tloop\tboolean\tNo\ttrue\tIndica si el slider debe hacer un bucle al llegar al final.\tseparationItems\tnumber\tNo\t\tSeparación entre elementos del slider.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Slider\n<Slider />"}},"/components/steps":{"title":"Steps","data":{"":"El componente Steps es un componente que muestra una lista de items en por pasos.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Steps, se puede hacer desde fenextjs o fenextjs-component\nimport { Steps, StepsProps } from \"fenextjs/cjs/component/Steps\";\no\nimport { Steps, StepsProps } from \"fenextjs-component/cjs/Steps\";","parametros#Parametros":"| Parametro            |                                             Tipo                                             | Requerido |   Default    | Descripcion                                                                                       |\n| -------------------- | :------------------------------------------------------------------------------------------: | :-------: | :----------: | :------------------------------------------------------------------------------------------------ | ------ | ----------------------------------------------------------------- |\n| _t                  |                                           string                                           |    No     |              | Propiedad de internacionalización.                                                                |\n| items                | { label: React.ReactNode; icon?: React.ReactNode; content: React.ReactNode; status?: \"none\" |   \"ok\"    | \"error\" }[] | Sí                                                                                                |        | Elementos de los pasos.                                           |\n| defaultStep          |                                           number                                           |    No     |      0       | Paso predeterminado para mostrar.                                                                 |\n| step                 |                                           number                                           |    No     |              | Paso actual para mostrar.                                                                         |\n| useArrowKey          |                                          boolean                                           |    No     |     true     | Indica si se deben utilizar las teclas de flecha para navegar entre pasos.                        |\n| useStep              |                                          boolean                                           |    No     |    false     | Indica si se deben mostrar los números de paso.                                                   |\n| btnPrev              |                                      React.ReactNode                                       |    No     |  \"Previous\"  | Contenido del botón anterior.                                                                     |\n| btnNext              |                                      React.ReactNode                                       |    No     |    \"Next\"    | Contenido del botón siguiente.                                                                    |\n| disabledBtnPrev      |                                          boolean                                           |    No     |    false     | Indica si el botón anterior está deshabilitado.                                                   |\n| disabledBtnNext      |                                          boolean                                           |    No     |    false     | Indica si el botón siguiente está deshabilitado.                                                  |\n| onPrev               |                               (step: number) => Promise<void>                               |   void   |      No      | Función de devolución de llamada al hacer clic en el botón anterior. Puede devolver una promesa.  |\n| onNext               |                               (step: number) => Promise<void>                               |   void   |      No      | Función de devolución de llamada al hacer clic en el botón siguiente. Puede devolver una promesa. |\n| onSetStep            |                                   (step: number) => void                                   |    No     |              | Función de devolución de llamada al establecer un paso específico.                                |\n| stepPos              |                                            \"top\"                                            |  \"left\"   |   \"right\"   | No                                                                                                | \"left\" | Posición de la lista de pasos. Puede ser \"top\", \"left\" o \"right\". |\n| showCurrentStepNStep |                                          boolean                                           |    No     |    false     | Indica si se debe mostrar el paso actual junto con el número total de pasos.                      |\n| useDogs              |                                          boolean                                           |    No     |    false     | Indica si se deben mostrar íconos de perro junto a los números de paso.                           |","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Steps\n<Steps />"}},"/components/tab":{"title":"Tab","data":{"":"El componente Tab es un componente que muestra una lista de tab con su respectivo contenido.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Tab, se puede hacer desde fenextjs o fenextjs-component\nimport { Tab, TabProps } from \"fenextjs/cjs/component/Tab\";\no\nimport { Tab, TabProps } from \"fenextjs-component/cjs/Tab\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\titems\tTabItemProps[]\tNo\t\tArray de objetos TabItemProps que representan las pestañas.\tonChange\t(item: TabItemProps) => void\tNo\t\tFunción de devolución de llamada al cambiar de pestaña.\tdefaultTab\tnumber\tNo\t\tÍndice de la pestaña que se mostrará por defecto.\tbeforeTabs\tReact.ReactNode\tNo\t\tComponente antes de la lista de encabezados de pestañas.\tafterTabs\tReact.ReactNode\tNo\t\tComponente después de la lista de encabezados de pestañas.\ttabScrollActive\tboolean\tNo\tfalse\tIndica si se deben mostrar todas las pestañas en un menú desplegable cuando hay demasiadas.\tvalidateTabOneHiddenHeader\tboolean\tNo\ttrue\tIndica si, cuando hay solo una pestaña, se debe ocultar el encabezado.","tabitemprops#TabItemProps":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tid\tstring\tSí\t\tIdentificador único de la pestaña.\thead\tReact.ReactNode\tSí\t\tContenido que se mostrará en el encabezado de la pestaña.\tbody\tReact.ReactNode\tSí\t\tContenido que se mostrará en el cuerpo de la pestaña.\tbeforeTab\tReact.ReactNode\tNo\t\tComponente antes del encabezado de la pestaña.\tafterTab\tReact.ReactNode\tNo\t\tComponente después del encabezado de la pestaña.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Tab\n<Tab />"}},"/components/table":{"title":"Table","data":{"":"El componente Table es un componente que muestra una tabla con columnas y filas personalizadas.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Table, se puede hacer desde fenextjs o fenextjs-component\nimport { Table, TableProps } from \"fenextjs/cjs/component/Table\";\no\nimport { Table, TableProps } from \"fenextjs-component/cjs/Table\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tname\tstring\tSí\t\tNombre de la tabla.\titems\tT[] (arreglo)\tSí\t\tArreglo de objetos de datos para mostrar en la tabla.\theader\tTableHeader<T>[] (arreglo)\tSí\t\tConfiguración del encabezado de la tabla.\tpagination\tPaginationProps (opcional)\tNo\t\tPropiedades opcionales de paginación para la tabla.\tloader\tboolean\tNo\tfalse\tIndica si se debe mostrar un cargador mientras se cargan los datos de la tabla.\ttypeLoader\t\"spinner\"                   | \"line\" (cadena)\tNo\t\"line\"\tTipo de cargador a mostrar. Puede ser \"spinner\" o \"line\".\tuseCheckbox\tboolean\tNo\tfalse\tIndica si se deben mostrar casillas de verificación en la tabla.\tonChecked\t(items: T[]) => void (función de devolución)\tNo\t\tFunción de devolución de llamada al marcar elementos en la tabla.\tonOrderBy\t{ id: keyof T; order: \"ASC\"          |    \"DESC\" }\tNo\t\tFunción de devolución de llamada al ordenar la tabla.\tonShowHidden\t{ id: keyof T; showHidden: \"SHOW\"       |   \"HIDDEN\" }\tNo\t\tFunción de devolución de llamada al mostrar u ocultar columnas en la tabla.\tnotResult\tReactNode (nodo React)\tNo\t\tElemento React a mostrar cuando no hay resultados en la tabla.\tshowPagination\tboolean\tNo\ttrue\tIndica si se debe mostrar la paginación en la tabla.","tableheader#TableHeader":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\tid\tkeyof T (clave de T)\tSí\t\tClave de propiedad en el objeto de datos que corresponde a esta columna de encabezado.\tth\tReact.ReactNode (nodo React)\tSí\t\tEtiqueta a mostrar en la columna de encabezado.\tparse\t(data: T) => any (función de transformación)\tNo\t\tFunción que se puede utilizar para transformar los datos antes de mostrarlos en la celda de la tabla. Esta función toma el objeto de datos para la fila y devuelve el valor transformado.\tcolumnOptions\t{ orderBy?: boolean; showHidden?: boolean; }\tNo\t\tOpciones adicionales de la columna para la tabla.\tdefaultShowHidden\t\"show\"                     | \"hidden\" (cadena)\tNo\t\"show\"\tIndica si la columna debe mostrarse o estar oculta de forma predeterminada. Puede ser \"show\" o \"hidden\".\tcolNewTr\tboolean\tNo\tfalse\tIndica si la columna debe ocupar el 100% del ancho en una nueva fila.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Table\n<Table />"}},"/components/text":{"title":"Text","data":{"":"El componente Text es un componente que muestra un contenedor de texto en sus distintas versiones.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Text, se puede hacer desde fenextjs o fenextjs-component\nimport { Text, TextProps } from \"fenextjs/cjs/component/Text\";\no\nimport { Text, TextProps } from \"fenextjs-component/cjs/Text\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\ttag\t\"p\" | \"strong\" | \"small\" | \"em\" | \"b\" | \"del\" | \"i\" | \"mark\" | \"ins\" |   \"sub\"   | \"sup\"\tNo\t\"p\"\tIndica el tipo de etiqueta HTML a utilizar para el texto. Puede ser \"p\", \"strong\", \"small\", \"em\", \"b\", \"del\", \"i\", \"mark\", \"ins\", \"sub\", o \"sup\".\tloader\tboolean\tNo\tfalse\tIndica si se debe mostrar un cargador mientras se carga el texto.\tnLineLoader\tnumber\tNo\t3\tNúmero de líneas que se deben mostrar en el cargador.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Text\n<Text />"}},"/components/theme":{"title":"Theme","data":{"":"El componente Theme es un componente que muestra un selectore de temas, claro, oscuro y automatico(toma el valor del navegador).","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Theme, se puede hacer desde fenextjs o fenextjs-component\nimport { Theme, ThemeProps } from \"fenextjs/cjs/component/Theme\";\no\nimport { Theme, ThemeProps } from \"fenextjs-component/cjs/Theme\";","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Theme\n<Theme />"}},"/components/title":{"title":"Title","data":{"":"El componente Title es un componente que muestra un contenedor de titulo en sus distintas versiones.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Title, se puede hacer desde fenextjs o fenextjs-component\nimport { Title, TitleProps } from \"fenextjs/cjs/component/Title\";\no\nimport { Title, TitleProps } from \"fenextjs-component/cjs/Title\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\ttag\t\"h1\"   |   \"h2\"    |  \"h3\"   | \"h4\" | \"h5\" | \"h6\"\tNo\t\"h1\"\tIndica el tipo de etiqueta HTML a utilizar para el título. Puede ser \"h1\", \"h2\", \"h3\", \"h4\", \"h5\" o \"h6\".\tloader\tboolean\tNo\tfalse\tIndica si se debe mostrar un cargador mientras se carga el título.","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Title\n<Title />"}},"/components/tooltip":{"title":"Tooltip","data":{"":"El componente Tooltip es un componente que muestra un contenerdor que al hacer hover muestra un contenido personalizado.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente Tooltip, se puede hacer desde fenextjs o fenextjs-component\nimport { Tooltip, TooltipProps } from \"fenextjs/cjs/component/Tooltip\";\no\nimport { Tooltip, TooltipProps } from \"fenextjs-component/cjs/Tooltip\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tchildren\tReactNode\tNo\t\tContenido del componente que activa el tooltip.\ttooltip\tReactNode\tNo\t\tContenido del tooltip a mostrar.\tpositionX\t\"center\" | \"right\" | \"left\"\tNo\t\"center\"\tPosición horizontal del tooltip. Puede ser \"center\", \"right\" o \"left\".\tpositionY\t\"center\" | \"top\" | \"bottom\"\tNo\t\"top\"\tPosición vertical del tooltip. Puede ser \"center\", \"top\" o \"bottom\".","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente Tooltip\n<Tooltip />"}},"/components/two-col-sticky":{"title":"TwoColSticky","data":{"":"El componente TwoColSticky es un componente que muestra un dos columnas con una de ellas sticky.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente TwoColSticky, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  TwoColSticky,\n  TwoColStickyProps,\n} from \"fenextjs/cjs/component/TwoColSticky\";\no\nimport {\n  TwoColSticky,\n  TwoColStickyProps,\n} from \"fenextjs-component/cjs/TwoColSticky\";","parametros#Parametros":"Parametro\tTipo\tRequerido\tDefault\tDescripcion\t_t\tstring\tNo\t\tPropiedad de internacionalización.\tchildren\tReactNode\tNo\t\tContenido principal del componente.\tcolSticky\tReactNode\tNo\t\tContenido de la columna que se mantiene pegajosa (sticky).\tposCol\t\"left\" | \"right\"\tNo\t\"left\"\tPosición de la columna pegajosa. Puede ser \"left\" o \"right\".","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente TwoColSticky\n<TwoColSticky />"}},"/components/user":{"title":"TwoColSticky","data":{"":"El componente TwoColSticky es un componente que muestra un dos columnas con una de ellas sticky.","ejemplo#Ejemplo":"","importacion#Importacion":"Para importar el componente TwoColSticky, se puede hacer desde fenextjs o fenextjs-component\nimport {\n  TwoColSticky,\n  TwoColStickyProps,\n} from \"fenextjs/cjs/component/TwoColSticky\";\no\nimport {\n  TwoColSticky,\n  TwoColStickyProps,\n} from \"fenextjs-component/cjs/TwoColSticky\";","parametros#Parametros":"Propiedad\tTipo\tRequerido\tDescripcion\tuser\tPartial<UserInterfaceProps>\tSí\tDatos parciales del usuario (Partial<UserInterfaceProps>).\tloader\tboolean\tNo\tIndica si se debe mostrar un cargador mientras se carga la información del usuario.","userinterfaceprops#UserInterfaceProps":"Propiedad\tTipo\tRequerido\tDescripcion\tstatus\tUserStatusProps\tSí\tEstado del usuario. Puede ser VERIFY, NOVERIFY, BAN o PENDING.\tid\tstring\tSí\tIdentificador único del usuario.\ttoken\tstring\tSí\tToken asociado al usuario.\tname\tstring\tSí\tNombre del usuario.\timg\tImgDataProps\tSí\tDatos de la imagen del usuario (ImgDataProps).\trole\tUserRoleProps\tSí\tRol del usuario. Puede ser ADMIN, CUSTOMER o BACKOFFICE.\tphone\tPhoneProps\tNo\tDatos del teléfono del usuario (PhoneProps).\temail\tstring\tSí\tDirección de correo electrónico del usuario.\tstripe_id\tstring\tNo\tIdentificador de Stripe asociado al usuario.\tdateCreate\tDate\tSí\tFecha de creación del usuario.\tverify\t{ [id in UserTypeVerifyProps]: UserStatusProps; }\tNo\tEstado de verificación para diferentes tipos de verificación (UserTypeVerifyProps).","storybook#Storybook":"Para ver el storybook del componente lo puede hacer con este link","usos#Usos":"Uso básico del componente TwoColSticky\n<TwoColSticky />"}},"/error":{"title":"Introduction","data":{}},"/firebase":{"title":"Introduction","data":{}},"/function":{"title":"Introduction","data":{}},"/hook":{"title":"Introduction","data":{}},"/img-placeholder":{"title":"Introduction","data":{}},"/":{"title":"Introducción","data":{"":"Agilizando el Desarrollo y productividad en Next.js.😉Bienvenidos a Fenext JS, una librería innovadora diseñada para revolucionar tu experiencia de desarrollo en Next.js. Nuestra misión es simplificar tu trabajo, ahorrándote tiempo valioso y energía en cada proyecto.Características Destacadas:\nComponentes Pre-hechos: Una colección extensa de componentes listos para usar, que van desde elementos de UI básicos hasta componentes más complejos.\nPersonalización a Medida: Flexibilidad para adaptar cada componente a las necesidades específicas de tu proyecto.\nHooks Propios: Funcionalidades avanzadas con hooks personalizados, facilitando tareas complejas y mejorando el rendimiento.\nComponentes\nErrores\nFunciones\nFunciones para Firebase\nHooks personalizados\nImágenes para placeholder\nInterfaces\nValidadores\nSVG's para iconos y animaciones","instalación-cómo-empezar#Instalación, cómo empezar:":"Fenext es compatible con varios gestores de paquetes. Aquí te explicamos cómo instalarlo usando NPM, BUN y PNPM.","npm#NPM":"NPM es el gestor de paquetes por defecto para Node.js y es ampliamente utilizado en la comunidad de JavaScript. Para instalar Fenext JS con NPM, ejecuta:\nnpm i fenextjs","bun#BUN":"BUN es un gestor de paquetes y un entorno de ejecución de JavaScript todo en uno, conocido por su velocidad y eficiencia. Instala Fenext JS con BUN usando:\nbun i fenextjs","pnpm#PNPM":"PNPM es un gestor de paquetes alternativo que se centra en el rendimiento y el ahorro de espacio. Para usar PNPM en la instalación de Fenext JS, utiliza:\npnpm i fenextjs"}},"/interface":{"title":"Introduction","data":{}},"/svg":{"title":"Introduction","data":{}},"/vaidator":{"title":"Introduction","data":{}}}